{
  "sightings": [
    {
      "summary": "freaked me out",
      "city": "San Jose",
      "state": "CA",
      "date_time": "2021-05-06T21:00:00",
      "shape": "sphere",
      "duration": "2 minutes",
      "report_link": "http://www.nuforc.org/webreports/163/S163041.html",
      "text": "freaked me out I looked up into the night sky to view the little dipper and I saw multiple round bright moving objects moving from left to right in a straight line.  i viewed them until i couldn't see them anymore.  there was no vapor streak, or sound.  they were not planes.  they were all moving at the same speed in a straight line.",
      "posted": "2021-05-20T00:00:00",
      "city_latitude": "37.33884202188921",
      "city_longitude": "-121.88970568835907",
      "id": 0
    },
    {
      "summary": "One object observed at closer ground distance, hoovering above local airport , 2others a distance away",
      "city": "Somerset",
      "state": "KY",
      "date_time": "",
      "shape": "unknown",
      "duration": "2400 hours",
      "report_link": "http://www.nuforc.org/webreports/151/S151813.html",
      "text": "One object observed at closer ground distance, hoovering above local airport, 2 others a distance away as if providing air support if needed.  Have observed before, not reported, only on very cold nights, and clear skies only, believe to be attracted to red tower lights,",
      "posted": "",
      "city_latitude": "37.09036082474221",
      "city_longitude": "-84.49816907216494",
      "id": 1
    },
    {
      "summary": "UFO contact we made during Desert Shield in the Indian Ocean.",
      "city": "",
      "state": "",
      "date_time": "",
      "shape": "",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/163/S163175.html",
      "text": "UFO contact we made during Desert Shield in the Indian Ocean. I, USN AW3(SAR)----- and pilots LCDR -------- and Lt ----, flying in the Indian ocean with HSL-33 attached to the USS William H. Standley with the Kitty Hawk battle group 1992-1993 from San Diego.  I found a contact on the radar doing OTH late at night looking for a small fishing vessel carrying small arms out of Yemen to Somalia. It was reported to the ship via datalink and radio.  Contact got within 7 miles of us, had lights and at first looked like a slow mover, helicopter or drone but then after several minutes of radar contact and visual it disappeared.",
      "posted": "",
      "city_latitude": "",
      "city_longitude": "",
      "id": 2
    },
    {
      "summary": "Over a course of 5 years, I have seen UFOs, observed bizarre behavior, and believe I may have directly been affected by it.",
      "city": "Germantown",
      "state": "MD",
      "date_time": "2005-07-06T12:00:00",
      "shape": "formation",
      "duration": "Years",
      "report_link": "http://www.nuforc.org/webreports/162/S162867.html",
      "text": "Over a course of 5 years, I have seen UFOs, observed bizarre behavior, and believe I may have directly been affected by it. In 2013, my friend and her boyfriend were driving us back to her house (in Hagerstown, MD at that time). I was looking out the window from the back seat when I saw a deep green light in the distance over the woods, in the sky, that moved slowly, horizontally, before pausing and dropping directly behind the trees.  In 2014, my friend and I were walking our coworker to her car outside of our restaurant job in Germantown (at that time). As we were talking to her before she ducked into her car, I noticed, again, a deep green light in the distance, in the direction of Father Hurley Blvd. It moved horizontally before pausing and dropping vertically. Later that Summer, we were driving on the back roads at night (in Boyds), when we saw large lights scattered within close proximity of each other in the sky. What freaked us out were the helicopters (3) and the plane-like drone that were flying towards them.  In 2016, I was walking home from a friends house mid-afternoon. I happened to glance up when I saw what looked like a large bundle of black balloons. What stood out to me was that they didn't appear to be moving, and I also couldn't make out if that's what it actually was (I can't see too well from afar). Shortly after, it broke up into several black pieces and sort of floated in the general direction I was walking in. I had taken my phone out and snapped a few photos right before it began to move, in which it had startled me. In me rushing home, my eyes kept on it when it eventually moved back together and kind of steadily and smoothly glided away.  To add to 2016; there was a night when these two figures in my neighborhood displayed very bizarre behavior that still has yet to sit well with me. I was on my porch some time after midnight when I heard shoes dragging against gravel from the end of my neighborhood. These two figures turned the corner at the end of the neighborhood and began to slowly walk in my general direction. They stopped at one point before one of them started to walk backwards at an angle, never turning to see what was behind him/her. The other person was walking towards a white van when they appeared to see me before taking a single step behind the van. I went inside at that point because of the sketchy behavior. We had a large, bay window in the living room/front of the house, so I peered behind the curtain. After a moment, I watched one of them make their way down my sidewalk, up my yard, to the window. They just stood there, never moved to look in or around, they just stood in front of me. I didn'! t make out a face as everything was dark within their hood. I eventually ran to get my brother and called the police. The next day, my uncle who lived up the block from us, his truck had been broken into and all of the papers within it tossed. Nothing was taken. That probably has nothing to do with the sightings, however directly after this happened, I started having dreams about things being on fire and tanks/planes falling from the sky. The dreams have not stopped yet, and are almost always consistent on a daily basis. I read that someone else who claimed to have seen UFO's had two men in hooded attire knock on his door late at night who frightened him. He claimed to have seen weird things in his head and had consistent dreams of wars. That's what made me want to bring this to light.  The last time I saw a UFO was in September of 2017 in Cancun, Mexico. It was at a resort and it seemed to be very far. It was pale looking and I think tic-tac like. I watched it move quickly back and forth but didn't know if I was actually seeing it. My brother's husband along with his brother claimed to then see it, which made me believe it was real. They are two of the biggest skeptics I know, so it solidified that for me.  I hope this sheds some light on your research, and I appreciate the work you all do in learning and expanding on the general knowledge of life as a whole.",
      "posted": "2021-05-20T00:00:00",
      "city_latitude": "39.15498641618498",
      "city_longitude": "-77.27253757225458",
      "id": 3
    },
    {
      "summary": "Driving north on US 87 just outside Brady, Texas to yellow circle lights fade and disappear.",
      "city": "Brady",
      "state": "TX",
      "date_time": "2020-01-29T19:45:00",
      "shape": "light",
      "duration": "Lights disappear",
      "report_link": "http://www.nuforc.org/webreports/152/S152953.html",
      "text": "Driving north on US 87 just outside Brady, Texas, to yellow circle lights fade and disappear.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "31.145100000000003",
      "city_longitude": "-99.3478",
      "id": 4
    },
    {
      "summary": "meteor or space junk?",
      "city": "San Diego",
      "state": "CA",
      "date_time": "2020-01-29T20:10:00",
      "shape": "fireball",
      "duration": "2 seconds",
      "report_link": "http://www.nuforc.org/webreports/152/S152974.html",
      "text": "Meteor or space junk?  There have been several articles on the internet about a possible sighting of a fireball or space junk seen over San Diego county and Los Angeles county after 10:00pm on Wednesday night 29 January 2020.  I live in San Diego.  I did not see the event after 10:00pm; but I thought i would mention there was an earlier event around 8:10pm the same night.  It also was either a large meteor or space junk?  The street I live on runs north-south.  As I was walking south a large meteor was seen while looking down the street to the south?  I didnt think much about it; butI did have the thought that it seemed to be coming down slower than most meteors. I know the approxiate time because I texted my Dad at 8:17pm that I had juist seen a meteor.  Anyway, thought I would mention this.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "32.78722907702912",
      "city_longitude": "-117.14026773074518",
      "id": 5
    },
    {
      "summary": "Shaped like a triangle, transparent like a light cloud camouflaged with the background but clear shape that could be seen through. Larg",
      "city": "Las Vegas",
      "state": "NV",
      "date_time": "2020-01-28T15:30:00",
      "shape": "triangle",
      "duration": "30",
      "report_link": "http://www.nuforc.org/webreports/152/S152943.html",
      "text": "Shaped like a triangle, transparent like a light cloud camouflaged with the background but clear shape that could be seen through.  Large triangle shaped cloaked spacecraft moving fast across the sky not so high above, seen in clear light around 4:30 pm.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "36.14124586319169",
      "city_longitude": "-115.18659190010753",
      "id": 6
    },
    {
      "summary": "I noticed an elongated blackish triangle shaped object. It seemed to be moving pretty fast it’s angle was very steep. I would say on a",
      "city": "Bear",
      "state": "DE",
      "date_time": "2020-01-22T09:35:00",
      "shape": "triangle",
      "duration": "3 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152791.html",
      "text": "I noticed an elongated blackish triangle shaped object.  It seemed to be moving pretty fast it’s angle was very steep.  I would say on a 30 degrees and moving down.  I was trying to get my phone and I was driving at the same time.  It just disappeared.,I would say it may have been viewed for a few minutes.  I never saw anything like this before.  I’m 42 now, and can’t find an explanation.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "39.60249999999997",
      "city_longitude": "-75.69449999999978",
      "id": 7
    },
    {
      "summary": "White rectangular craft in southwest Florida",
      "city": "Port Charlotte",
      "state": "FL",
      "date_time": "2020-01-22T10:32:00",
      "shape": "rectangle",
      "duration": "10 seconds",
      "report_link": "http://www.nuforc.org/webreports/152/S152831.html",
      "text": "White rectangular craft in southwest Florida Driving my 2nd grader to school, he mentions he saw “something” in the sky. He proceeded to explain seeing a rectangular object. He described it as white with some black spots to one side and in the sky “way higher” than a plane.  He didn’t see it for long as I turned in a different direction and he lost sight of it.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "26.981006611570255",
      "city_longitude": "-82.11690661157034",
      "id": 8
    },
    {
      "summary": "Large Moving Bright Red Light Over Battle Creek",
      "city": "Battle Creek",
      "state": "MI",
      "date_time": "2020-01-22T19:18:00",
      "shape": "light",
      "duration": "2 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152825.html",
      "text": "Large Moving Bright Red Light Over Battle Creek It was dark outside. I went out to smoke a cigarette and saw a round bright red light, not flashing, moving slowly towards me from north to south.  It was in the direction of the airport here, but it did not have the required red light on the left wing and green light on the right. It also did not have any type of rotating beacon light.  It was maybe 5 miles distant at about 3000'. It maneuvered slowly and strangely.  It never got closer to me than maybe 3 miles (?).  It made no sound, and as it was quiet outside, I likely would have been able to hear it at the estimated distance, like other aircraft I have seen out at the airport (KBTL). It turned towards the north and the light faded quite rapidly and became white. The main thing strange I noticed was the unusually bright red light.  I have seen bright WHITE landing lights on aircraft, but never a very bright red one (I am a pilot and aircraft dispatcher and have been involved with aviation my entire life).  This is not my first report on this site. I just wanted to post here to see if anyone else saw this.  I told my friend about it, who lives in the city of Coldwater (about 30 miles southeast of me.  He said he too saw it about 30 minutes later over his town, off to east (a bright non-flashing red light).  I checked flightaware.com and saw no aircraft matching the flight profile I witnessed.  I filmed it with my iphone6, a bit through the trees and have included it here.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "42.327892803030224",
      "city_longitude": "-85.18855946969687",
      "id": 9
    },
    {
      "summary": "Seen 3 middle one flashed as if it were a mirror, commercial plane flew past within no time jets flew through and went around objects,",
      "city": "Detroit",
      "state": "MI",
      "date_time": "2020-01-20T15:00:00",
      "shape": "flash",
      "duration": "45 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152760.html",
      "text": "Seen 3 middle one flashed as if it were a mirror, commercial plane flew past within no time jets flew through and went around objects, they were visible for a few not sure if seconds or minutes then they were just gone.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "42.3688546744034",
      "city_longitude": "-83.11026847195292",
      "id": 10
    },
    {
      "summary": "Fireball in southeast sky that changed shapes.",
      "city": "Mastic Beach",
      "state": "NY",
      "date_time": "2020-01-12T18:57:00",
      "shape": "fireball",
      "duration": "4 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152749.html",
      "text": "Fireball in southeast sky that changed shapes. Fireball was hovering low outside my bedroom window, facing south.  The fire started to move upward and then backward.  The fireball moved slowly east in a up and down zigzag motion.  I heard numerous car horns beeping in the distance.  Lost sight of the fireball as it moved southeast.  I have a video and the fireball was not shooting across the sky like a meteor.  I called Suffolk County Police to make a report.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "40.76620000000001",
      "city_longitude": "-72.83770000000001",
      "id": 11
    },
    {
      "summary": "A series of soft white lights were traveling in a pattern on straight line from NW to SE. ((\"Starlink\" satellites??))",
      "city": "Chennai (India)",
      "state": "",
      "date_time": "2020-01-10T05:35:00",
      "shape": "light",
      "duration": "10-15 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152475.html",
      "text": "This early hour of 01.10.2020 a series of soft white lights were traveling in a pattern on straight line from North West to South East.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 12
    },
    {
      "summary": "I looked up in the sky above the lights and there was a long oval blackish disc.",
      "city": "Idaho Falls",
      "state": "ID",
      "date_time": "2020-01-06T18:45:00",
      "shape": "",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/152/S152332.html",
      "text": "Jan 6, 2020  At 6:45 I was headed down Broadway to go to Little Caesars and Walmart and I remember when I was driving I looked up in the sky above the lights and there was a long oval blackish disc and right away knew it did not belong there was odd just said to myself that looks like an  alien spaceship then wondered do any of these cars driving by even notice this thing?? I remember that day there was not a cloud in the sky all day long and then even in the evening as you’ll see in the pictures there was no clouds around this thing and it was just hovering and it didn’t belong there I just remember just staring at it and it creeped me out and I wanted to get more pictures when I pulled into Walmart and thought I’ll get better pictures and when I pulled in I got out and could not see it perhaps the building was covering it and by then it had gotten so dark so I said to heck with it and did my shopping.  But did take two pics of it.  And the reason I am adding this to your website today was the fact I wanted to actually see if it was added to the log at all, noticed not, so I am adding it.",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "43.47350769230773",
      "city_longitude": "-112.00362435897435",
      "id": 13
    },
    {
      "summary": "Bright light going east to west burning steady light across the sky",
      "city": "Commercial Point",
      "state": "OH",
      "date_time": "2020-01-01T20:08:00",
      "shape": "",
      "duration": "3 seconds",
      "report_link": "http://www.nuforc.org/webreports/152/S152148.html",
      "text": "Bright light going east to west burning steady light across the sky",
      "posted": "2020-01-31T00:00:00",
      "city_latitude": "39.7694",
      "city_longitude": "-83.064",
      "id": 14
    },
    {
      "summary": "15 Luces intensas, una de ellas más brillante y más grande.",
      "city": "Hollywood",
      "state": "FL",
      "date_time": "",
      "shape": "changing",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/152/S152616.html",
      "text": "15 Luces intensas, una de ellas más brillante y más grande.",
      "posted": "",
      "city_latitude": "26.00384686961525",
      "city_longitude": "-80.25853004020604",
      "id": 15
    },
    {
      "summary": "UFO OVER ONTARIO, OREGON",
      "city": "Ontario",
      "state": "OR",
      "date_time": "",
      "shape": "disk",
      "duration": "10 seconds",
      "report_link": "http://www.nuforc.org/webreports/151/S151935.html",
      "text": "UFO OVER ONTARIO, OREGON I had just left the state park north of Ontario, Oregon and was just crossing over I-84 Highway when I noticed a cool cloud formation, I usually stop to take these kind of pictures besides sunsets. I pulled off the side of the road and put my window down to take a picture of the cloud formation.  I took only one picture then I got my window up and continued on my way into town and home.  When I got home and parked I looked at the picture and thought it looked cool.  I happen to notice a black dot way over on the bottom left of  the picture.  I expanded the image and noticed it looked like a disc tilted and facing my way when I had taken the picture.  I was excited to have captured this.  Looks like a disc to me.  You be the judge,I  will be sending the picture email with this report.",
      "posted": "",
      "city_latitude": "44.086099999999995",
      "city_longitude": "-117.01880000000004",
      "id": 16
    },
    {
      "summary": "http://youtube.com/watch?v=eslXZomIFP4&search=ufo%20airfield",
      "city": "",
      "state": "",
      "date_time": "",
      "shape": "",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/050/S50752.html",
      "text": "http://youtube.com/watch?v=eslXZomIFP4&search=ufo%20airfield ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  Link may be defective.  PD))",
      "posted": "",
      "city_latitude": "",
      "city_longitude": "",
      "id": 17
    },
    {
      "summary": "Watching Sunday or Monday night football went outside too record my thoughts. I started the camera recording for twelve minutes and rec",
      "city": "Santa Maria",
      "state": "CA",
      "date_time": "",
      "shape": "circle",
      "duration": "19:00",
      "report_link": "http://www.nuforc.org/webreports/152/S152255.html",
      "text": "Watching Sunday or Monday night football went outside too record my thoughts. I started the camera recording for twelve minutes and recorded several different lights.  The UFO is in the first minute and half.  I recorded this on a TracFone CL",
      "posted": "",
      "city_latitude": "34.868013432835745",
      "city_longitude": "-120.35571119402906",
      "id": 18
    },
    {
      "summary": "It was the first Arctic blast we had in ga.there we 2 shipsin the sky then. ((anonymous report))",
      "city": "",
      "state": "",
      "date_time": "",
      "shape": "",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/152/S152283.html",
      "text": "It was the first Arctic blast we had in ga.there we 2 ships in the sky then.  We were under one it shot up real fast then it split into 2 ships then there were 3 I have pics but pics are different what I was seeing.",
      "posted": "",
      "city_latitude": "",
      "city_longitude": "",
      "id": 19
    },
    {
      "summary": "A bright orange light hovering to the west of my property very high in the sky, for around 25 minutes. The craft then started moving to",
      "city": "Little Rock",
      "state": "AR",
      "date_time": "",
      "shape": "unknown",
      "duration": "25 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152751.html",
      "text": "A bright orange light hovering to the west of my property very high in the sky, for around 25 minutes.  The craft then started moving to the east, at a great rate of speed, then turned straight up at  a 90 degree angle until it completely disappeared.  It accelerated and changed direction faster than anything I have ever seen.   I live 5 miles west of the Little Rock air force base,  so I see jets and planes daily.  Nothing moves or maneuvers like this did.",
      "posted": "",
      "city_latitude": "34.73753627684961",
      "city_longitude": "-92.36319236276871",
      "id": 20
    },
    {
      "summary": "A contrail was headed toward the ground and then changed direction after 3 more aircraft were drawing near",
      "city": "Harrisonburg",
      "state": "VA",
      "date_time": "2020-01-06T13:45:00",
      "shape": "unknown",
      "duration": "15 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152389.html",
      "text": "A contrail was headed toward the ground and then changed direction after 3 more aircraft were drawing near As I was driving to work I noticed a very short contrail plummeting toward the ground. About 5 minutes go by, and 3 aircraft coming from NE, N, and NW start closing in on the object.  As soon as the aircraft coming in from NE drew near, the contrail changed direction and started heading South.  After 10 more minutes all three aircraft were closing in on the contrail, but that was all I got to see before my exit.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "38.43080419847336",
      "city_longitude": "-78.88316106870256",
      "id": 21
    },
    {
      "summary": "about 3 weeks prior to this sighting, I was driving south on I-65 headed towards Mobile right at Mile Marker 16.  I observed a shiny sa",
      "city": "Saraland",
      "state": "AL",
      "date_time": "2020-01-06T16:25:00",
      "shape": "disk",
      "duration": "15 seconds",
      "report_link": "http://www.nuforc.org/webreports/152/S152432.html",
      "text": "about 3 weeks prior to this sighting, I was driving south on I-65 headed towards Mobile right at Mile Marker 16.  I observed a shiny saucer shaped object that was motionless in the sky.  The time was around 3:30 pm and the sky was over cast.  The reflection of the little bit of sunlight we had light we had that afternoon was shining against the dark clouds behind it.  It did not move and it appeared to be about a half mile ahead of me,  motionless,  maybe 200 yards above the tree lined  ahead.  I kept thinking, is anyone else on the interstate seeing this?   It did not move at all  while I watched it for about 1 minute and then it instantly disappeared.   I was not frightened at all, but  felt very peaceful about what I had just seemed and curious if any one else driving had witnessed it.  I mentioned it to my mom and husband that night and was very sure of what I had seen.  Today, on my way home around 4:25 pm, I noticed it again, within 2 miles of the first location. It looked exactly as it did the day 3 weeks before, with the the sun reflecting brightly on its top side. The material looked like a brushed nickel finish .   I pulled over immediately to take a picture but it disappeared again.   I will continue to watch for it.  I am curious if anyone else has been seeing them in this area.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "30.839500000000026",
      "city_longitude": "-88.09679999999993",
      "id": 22
    },
    {
      "summary": "Round Silver Object and Cigar Shaped Silver  Object sighted hovering, then disappearing, then reappearing in Concordville.",
      "city": "Concordville",
      "state": "PA",
      "date_time": "2020-01-06T16:40:00",
      "shape": "cigar",
      "duration": "30 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152525.html",
      "text": "Round Silver Object and Cigar Shaped Silver  Object sighted hovering, then disappearing, then reappearing in Concordville. I was leaving work when I looked up in the sky and saw a round silver object and a cigar silver shaped object up in the sky.  The round object was to the left of the cigar shaped object.  They both just stood there, silent, hovering.  I watched as a couple of airplanes flew by in the distance above and below these objects. I pulled out my camera and the circle object disappeared.  I put my camera down and the circle object reappeared to the right of the cigar. I managed to film a little bit of it on my cellphone.  The round object would disappear, then the cigar shaped object disappeared. I put my camera down and they reappeared. It lasted for about a half hour before both disappeared.  I did a search on the internet to see if anyone else saw what I saw and found an old report almost exactly a year ago in the same city of a sighting in Concordville with a round  and a cigar shaped object.  I am a paralegal and this is the third sighting that I've reported to Nuforc.  I do not know what it is, but I am curious and fascinated and just want to know what it is!  I've ruled out airplane because I saw a couple fly by. I've ruled out drone because the hovering crafts did not look like them and no sound and they disappeared to the naked eye and reappeared. Amazing!",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 23
    },
    {
      "summary": "High Point North Carolina before crossing the bridge. Witnessed lights before crossing the bridge and after crossing another person pul",
      "city": "High Point",
      "state": "NC",
      "date_time": "2020-01-06T16:48:00",
      "shape": "cigar",
      "duration": "10 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152403.html",
      "text": "High Point North Carolina before crossing the bridge. Witnessed lights before crossing the bridge and after crossing another person pulled over to record. Light, thin, cigar shaped different lengths.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "35.974904029304035",
      "city_longitude": "-80.0163692307691",
      "id": 24
    },
    {
      "summary": "I saw a light in the sky and I believed it was an alien spacecraft because the light shut off and it disappeared into the sky.",
      "city": "Akron",
      "state": "PA",
      "date_time": "2020-01-06T17:00:00",
      "shape": "light",
      "duration": "17:00",
      "report_link": "http://www.nuforc.org/webreports/152/S152387.html",
      "text": "I saw a light in the sky and I believed it was an alien spacecraft because the light shut off and it disappeared into the sky. I was driving. I saw a bright light in the sky. I asked my boyfriend if it was a star. He said it was a helicopter. It was an unusual light because it caught my attention. I thought it must have been a new technology. It was dusk out and there were clear skies. We only saw one white light that was very bright and then it seem to have the bright light shut off. The off light was dim and round and blurry because I didn’t have my glasses, I wasn’t able to see the actual shape of the object. It wasn’t a helicopter after all because we didn’t see the spinning wings of a helicopter once the light was off and then I told my boyfriend it was a U.F.O.! He said it wasn’t a U.F.O. because he said that it was supposedly an alien spacecraft. The dim light disappeared into the sky. We were driving downhill on Main Street, in Akron, at the Loyd H. Roland Memorial Park. This light was seen in the sky which it was hovering above the intersection of Main Street and Park Stree! t. My son is twelve years old. He was in the van with us and he also seen the light which we all assumed it was an alien spacecraft.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "40.1567",
      "city_longitude": "-76.20329999999998",
      "id": 25
    },
    {
      "summary": "Five square lights in a V formation hovering above the clouds",
      "city": "Westminster",
      "state": "CO",
      "date_time": "2020-01-06T17:05:00",
      "shape": "formation",
      "duration": "Unknown",
      "report_link": "http://www.nuforc.org/webreports/152/S152836.html",
      "text": "Five square lights in a V formation hovering above the clouds On 1/6/2020 I was at the Quality Inn and Suites in Westminster, Co and took several pictures of the sunset. Upon reviewing the photos there appear to be five square shaped white lights in a V formation hovering above the cloud line.  There is an obvious contrail through the clouds beneath.  In the photos taken directly after, within the same minute, the lights are no longer there. I am a local business owner.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "39.869197777777686",
      "city_longitude": "-105.04200666666647",
      "id": 26
    },
    {
      "summary": "So me and my brother were driving home through this town. And up in the sky was these bright orange yellow lights.  At first we thought",
      "city": "Wayne",
      "state": "NY",
      "date_time": "2020-01-05T08:00:00",
      "shape": "fireball",
      "duration": "30 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152524.html",
      "text": "So me and my brother were driving home through this town.  And up in the sky was these bright orange yellow lights.  At first we thought it was a helicopter because it pirouetted twice.  But it wasn't blinking.  So this is the country side and alot of people have airplanes, so then we thought it was a plane on fire, because it was falling and spinning and it was so bright. But then it leveled of at about 80 feet.  And in a blink of an eye it was atleast 3 miles away then just disappeared.  I called a friend the next day and she lives in this town and she saw it too and thought it was a crashing plane.  But I'm telling you it was not!!!  And there was no sound, which I found odd.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 27
    },
    {
      "summary": "I was driving my children and my granddaughter and her friend home.   We were traveling East on Vance Avenue.  The closer we got to Wal",
      "city": "Fort Wayne",
      "state": "IN",
      "date_time": "2020-01-03T10:50:00",
      "shape": "disk",
      "duration": "5-7 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152298.html",
      "text": "I was driving my children and my granddaughter and her friend home.   We were traveling East on Vance Avenue.  The closer we got to Walden Addition we noticed an object with lights to the right of us he hovering above the houses to the left of us.  The object was very large.  Larger than a drone or helicopter.  It maneuvered in many different directions.  Up down, side to side.  We stopped on the side of the road to get a closer look.  The object began to get closer to my car.  I continued to drive down Vance to our destination.  The object began to follow us.  I sped up and the object still was above us.  We got to the destination and dropped off the kids.  We continued to drive home and my son saw the object hovering above the houses as if it was waiting on us.  We sped home and it took off very fast in the other direction. ((NUFORC Note:  Time indicated by source of original report was flawed.  We have amended the time, in order to reflect a nighttime sighting.  PD))",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "41.09336991071444",
      "city_longitude": "-85.1455725",
      "id": 28
    },
    {
      "summary": "I witnessed disc/saucershaped object over Angeles forest. I was looking towards NEt from west la parking garage.  ((anonymous))",
      "city": "Los Angeles",
      "state": "CA",
      "date_time": "2020-01-01T07:00:00",
      "shape": "disk",
      "duration": "5+ minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152193.html",
      "text": "I witnessed disc/saucershaped object over Angeles forest.  I was looking towards north east from west la parking garage around 7am.  Object was still for several minutes.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "34.05070709048434",
      "city_longitude": "-118.27993506712305",
      "id": 29
    },
    {
      "summary": "Triangle formation of lights in night sky disappearing into the night at the same spot in the same way as if disappearing into a hole.",
      "city": "Corpus Christi",
      "state": "TX",
      "date_time": "2020-01-01T00:04:00",
      "shape": "triangle",
      "duration": "30 seconds",
      "report_link": "http://www.nuforc.org/webreports/152/S152645.html",
      "text": "Triangle formation of lights in night sky disappearing into the night at the same spot in the same way as if disappearing into a hole. During New Years Eve when the neighbors were popping fireworks outside I took my daughters outside to see them while we waited for my wife to arrive from work.  While viewing the fireworks in the sky that were about 2 blocks away we noticed a triangle formation of lights that were flickering red and white and were almost above us.  The formation was located east/ southeast of the fireworks and were traveling at the same speed and seemed to hover for about 30-35 seconds.  We thought they were fireworks at first but then we noticed that they did not behave or explode with sparks like fireworks did and they lasted longer than any of the fireworks in the sky.  As they disappeared, they seemed to disappear into the darkness of the night sky only to the right of the formation and in the same way, slowly one at a time.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "27.71750016181213",
      "city_longitude": "-97.40525129449863",
      "id": 30
    },
    {
      "summary": "I was driving down the red mountain expressway, and saw a large silver disc/circular shaped craft in the sky.",
      "city": "Birmingham",
      "state": "AL",
      "date_time": "2019-12-30T12:00:00",
      "shape": "disk",
      "duration": "30-45 seconds",
      "report_link": "http://www.nuforc.org/webreports/152/S152119.html",
      "text": "I was driving down the red mountain expressway, and saw a large silver disc/circular shaped craft in the sky. It moved unnaturally from one point to another.  Speeds that aren't possible.  I tracked it for around 45 seconds trying alert others on the road to the object.  It had what looked like larger thrusters cylindrical shaped on two sides.  Golden aura around the thrusters.  I looked away to exit the highway, and when I looked back I saw it for a split second, and then it vanished.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "33.480915796519156",
      "city_longitude": "-86.77946934404252",
      "id": 31
    },
    {
      "summary": "I happened to look up to the right and saw a white light that was like a star at first then it grew in size and the white light intensi",
      "city": "Glen Cove",
      "state": "NY",
      "date_time": "2019-12-27T21:55:00",
      "shape": "circle",
      "duration": "7 seconds",
      "report_link": "http://www.nuforc.org/webreports/151/S151963.html",
      "text": "I happened to look up to the right and saw a white light that was like a star at first then it grew in size and the white light intensity was so damn bright I have never ever seen anything close to the intensity and purity of this white light.  It grew about 5 times in size and then the light blinked out towards the center of the light.  It was round in shape and started as a pin dot then the dot was moving downward and after about 5 seconds moving slowly downward the brightness and size grew very quickly and then when it was its brightest it quickly shrank toward the center and waa as gone.  There was mo streaking from a meteor or no smoke nothing and it moved slowly downward.  This was the most amazing thing I ever saw and the brightest brighter then the sun and was pure I mean pure white with such intensity.  No sound",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "40.87420000000009",
      "city_longitude": "-73.6232",
      "id": 32
    },
    {
      "summary": "Reddish orange orbs that changed to white and disappeared at a high rate of speed",
      "city": "Tybee Island",
      "state": "GA",
      "date_time": "2019-12-25T20:30:00",
      "shape": "sphere",
      "duration": "30 seconds",
      "report_link": "http://www.nuforc.org/webreports/152/S152031.html",
      "text": "Reddish orange orbs that changed to white and disappeared at a high rate of speed My boyfriend and I were walking our dog about 8:30 pm on Christmas night 2019.  On our way back, I looked up and saw 6 reddish orange spheres/lights hovering above us.  They were all hovering and moving south at the same slow speed.  There was no sound at all and the lights were not flashing.  I said to my boyfriend, \"hey, what is THAT?\"  When he looked up, the lights changed to white and then we could only see four.   At that point they looked to me almost like hazy little diamond shapes with a tiny circle in the center.  My boyfriend said he did not see the diamond shapes, only little white circular orbs.  They moved together and then apart again and did some acrobatics and crossed paths before they shot apart.  After that, two went east and two went west at a high rate of speed and disappeared.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "32.028",
      "city_longitude": "-80.9361",
      "id": 33
    },
    {
      "summary": "Saw several glowing red objects hovering almost the shape of the big Dipper. They were traveling south East until they disappeared in t",
      "city": "Lexington",
      "state": "NC",
      "date_time": "2019-12-24T19:00:00",
      "shape": "sphere",
      "duration": "10 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152016.html",
      "text": "Saw several glowing red objects hovering almost the shape of the big Dipper.  They were traveling south East until they disappeared in the tree line.  The objects made no sound.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "35.79657604790423",
      "city_longitude": "-80.25426766467086",
      "id": 34
    },
    {
      "summary": "Low flying aircraft with red lights and no sound.",
      "city": "Penfield",
      "state": "NY",
      "date_time": "2019-12-23T10:30:00",
      "shape": "triangle",
      "duration": "2 minutes",
      "report_link": "http://www.nuforc.org/webreports/151/S151967.html",
      "text": "Low flying aircraft with red lights and no sound. My son and I saw some type of aircraft that had a triangle, square and rectangle shape with red/ orange lights.  It was hovering low with no sound.  No flashing lights.   We turned around to try and take a photo but it was gone.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "43.14730000000002",
      "city_longitude": "-77.44270000000004",
      "id": 35
    },
    {
      "summary": "Loud Humming sound",
      "city": "Jacksonville",
      "state": "NC",
      "date_time": "2019-11-20T11:00:00",
      "shape": "unknown",
      "duration": "4 hours",
      "report_link": "http://www.nuforc.org/webreports/152/S152294.html",
      "text": "Loud Humming sound Loud Humming noise. Unbearable Humming noise lasting 2 to 4 hours everyday for the last several months.  It is so loud I am unable to sleep.  My boyfriend can hear it as well.  I reported it to the power company, thinking it may be a transporter.  It has gotten so loud that I am going to have to move.  It is a vibration as well.  I bought some ear plugs , but it only provides small amount of relief.  My boyfriend has put sound proofing on the walls but to no avail.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "34.78280411764701",
      "city_longitude": "-77.41268470588257",
      "id": 36
    },
    {
      "summary": "Son driving home- in the country. He saw a circular shape rotating with 3 bright lights. The lights were also circulating. The object w",
      "city": "Graettinger",
      "state": "IA",
      "date_time": "2019-09-09T21:00:00",
      "shape": "circle",
      "duration": "2 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152697.html",
      "text": "Son driving home- in the country. He saw a circular shape rotating with 3 bright lights. The lights were also circulating.  The object was following him, and he was driving a pick up with cab lights pulling a trailer with lights also.  We felt the object was intrigued by this and followed him. He called us and asked if we were watching it, and when we went to the window to look it shot off to the SE extremely fast and disappeared.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "43.234",
      "city_longitude": "-94.737",
      "id": 37
    },
    {
      "summary": "Right after midnight 3 people witnessed a huge clear triangular craft over a field near the golf course. Too low to be a plane. It had",
      "city": "Greenfield",
      "state": "IN",
      "date_time": "2019-01-01T00:05:00",
      "shape": "triangle",
      "duration": "1 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152308.html",
      "text": "Right after midnight 3 people witnessed a huge clear triangular craft over a field near the golf course.  Too low to be a plane.  It had lights in each corner that rotated with what seemed like chrome in color.  It went straight up extremely fast.  No noise.",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "39.815",
      "city_longitude": "-85.78349999999973",
      "id": 38
    },
    {
      "summary": "Hello, I'm 60 years old now and my witness and i had seen this ufo when i was 17 or 18 years old in the Summer time. This would have be",
      "city": "Coquitlam",
      "state": "BC",
      "date_time": "1978-07-20T17:00:00",
      "shape": "triangle",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/152/S152433.html",
      "text": "Hello, I'm 60 years old now and my witness and i had seen this ufo when i was 17 or 18 years old in the Summer time.  This would have been 1977 or 1978 i beleive. It was a Summer evening just when the first stars started to come out and my girlfriend and i were on the porch facing west where the sun goes down.  Shortly  after the sun went down and we could see the stars just starting to come out we noticed one way way off in the distance that was much brighter than the rest.  We watched it for a bit and then all of a sudden it moved super fast like within a blink of a eye and was then pretty much right above us, i would say about the same height in the sky as a big plane would be.  It just stayed above us, it was triangle in shape and had 3 oval cylinders underneath.  From what I remember there was no sound or very little but it had a very powerful presence about it unless that was just happening to us from us seeing this.  I almost felt like if anything the sound was muffled.  It wasn't there long , maybe a minute, or so, and then as fast as it showed up, it was gone in a blink of a eye",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "49.273139999999955",
      "city_longitude": "-122.79733358974303",
      "id": 39
    },
    {
      "summary": "Went outside to take a smoke looked up saw about 5 or 6 fireballs circling it was me and my step brother they looked as if they were al",
      "city": "Clay",
      "state": "AL",
      "date_time": "2005-07-11T01:30:00",
      "shape": "fireball",
      "duration": "1-2 minutes",
      "report_link": "http://www.nuforc.org/webreports/153/S153022.html",
      "text": "Went outside to take a smoke looked up saw about 5 or 6 fireballs circling it was me and my step brother they looked as if they were all separate but it was dark they could've all been attached   I tried catching them with a camera on my phone but they didn't show by of the quality of my camera and the speed they were going was to fast but its something I'll never forget",
      "posted": "2020-02-07T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 40
    },
    {
      "summary": "bright light to close for modern aircraft",
      "city": "Medford",
      "state": "OR",
      "date_time": "2020-05-02T21:45:00",
      "shape": "light",
      "duration": "5 mintes",
      "report_link": "http://www.nuforc.org/webreports/156/S156164.html",
      "text": "bright light to close for modern aircraft Light from 7 crafts flying above medford oregonon following another traveling at high speed appx 25000 feet very fast same path tn north north east towards crater lake estimated. came  of cloud coverage very close together same flight path",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "42.31514948096865",
      "city_longitude": "-122.84606678200646",
      "id": 41
    },
    {
      "summary": "Appeared as 9 satellites traveling on the same flight path 10 seconds apart.  ((Starlink satellites?))",
      "city": "Phoenix",
      "state": "AZ",
      "date_time": "2020-05-01T21:05:00",
      "shape": "light",
      "duration": "3-4 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156132.html",
      "text": "Appeared as 9 satellites traveling on the same flight path 10 seconds apart I noticed a light in the sky directly overhead that had all the characteristics of a satellite traveling approx. SW to NE. I have observed satellites in the past and at first I thought that this object was also a satellite. Then I noticed another one traveling in what appeared to be the same flight path approx. 10 seconds after the first.  As I watched, a total of 9 objects tracked across the sky along the same path and approx. 10 seconds apart.  Because they were traveling across the sky in a type of convoy (for lack of a better term), I could see as many as 4 at one time. Since I knew that the sun had set an hour or so earlier, I assumed that what I was seeing was sunlight reflecting off of them. This seemed to be the case since as they tracked to the northeast, they faded out. There wasn't any sound or aircraft marker lights. I just thought I'd report it because I'm not aware of satellites traveling along the same path in organized groups.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "33.5353805506076",
      "city_longitude": "-112.04946000000058",
      "id": 42
    },
    {
      "summary": "There were 10-20 Star-like figures gliding across the sky in unison.  ((Starlink satellites?))",
      "city": "Jacksonville",
      "state": "FL",
      "date_time": "2020-04-30T21:30:00",
      "shape": "light",
      "duration": "2 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156065.html",
      "text": "There were 10-20 Star-like figures gliding across the sky in unison. As I was going for my evening walk, I looked up in the sky and initially I thought I saw stars but I noticed that these star-like figures were moving in the sky.  They moved all at once in almost a perfectly straight line.  The line was diagonal had a downward slope if you look from left to right.  There was somewhere between 10 and 20 of these star-like figures and they all were moving in the same direction, at the same speed, and at the same pace.  The sky was dark and these figures glided across the sky and within no more than 1-2 minutes, the figures were completely out of my sight.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "30.266904680970416",
      "city_longitude": "-81.61637283365769",
      "id": 43
    },
    {
      "summary": "About 20 Craftsin the sky moving at a fast rate in a single filed line.  ((Starlink satellites??))",
      "city": "Birmingham",
      "state": "AL",
      "date_time": "2020-04-29T21:00:00",
      "shape": "circle",
      "duration": "Night",
      "report_link": "http://www.nuforc.org/webreports/155/S155991.html",
      "text": "As i was outside in my driveway,there was about 20 &quot;Crafts&quot; in the sky moving at a fast rate in a single filed line,one after As i was outside in my driveway,there was about 20 \"Crafts\" in the sky moving at a fast rate in a single filed line,one after the other.. I called my wife outside and pointed towards the sky and she was in Awe and asked.  \"What are those\"? Babe,i have  no idea.. but what we witness was far beyond the clouds.. No Sound!! But beautiful!! When i say that they were in a single file lines.. that's EXACTLY what i mean.. No Airplane could accomplish that feat of being so close... people,  i know what we saw! I stayed outside  for an hr or so hoping they would come back..Never did. It was Awesome.  I do know that we are not the ONLY BEINGS in this galaxy.  And tonight proved just that.  May the creator's continue to Keep us.. AMEN",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "33.480915796519156",
      "city_longitude": "-86.77946934404252",
      "id": 44
    },
    {
      "summary": "4-28-20 3:10 pm I took three photos of a commercial plane flying East past our moon which was visible at the time. In the second photo",
      "city": "Eugene",
      "state": "OR",
      "date_time": "2020-04-28T15:00:00",
      "shape": "circle",
      "duration": "Snap shot",
      "report_link": "http://www.nuforc.org/webreports/156/S156324.html",
      "text": "4-28-20 3:10 pm I took three photos of a commercial plane flying East past our moon which was visible at the time.  In the second photo  a dark object appears in front of plain which was not visible when taking photo.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "44.0395449832778",
      "city_longitude": "-123.12515735785941",
      "id": 45
    },
    {
      "summary": "MADAR Node 105, replaces 04/28/2020 same location",
      "city": "Watsonville",
      "state": "CA",
      "date_time": "2020-04-27T21:09:00",
      "shape": "",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/156/S156419.html",
      "text": "MADAR Node 105, replaces 04/28/2020 same location",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "36.95027518796997",
      "city_longitude": "-121.72474210526329",
      "id": 46
    },
    {
      "summary": "They were seen flying southeasterly Direction. I will find a straight line formation smaller ones in the front followed by one large ai",
      "city": "Markham",
      "state": "IL",
      "date_time": "2020-04-26T18:00:00",
      "shape": "formation",
      "duration": "2 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155835.html",
      "text": "They were seen flying southeasterly Direction. I will find a straight line formation smaller ones in the front followed by one large aircraft.  The larger aircraft had long needle nose with a triangular body shape.  I do have some video footage.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "41.59359999999999",
      "city_longitude": "-87.69480000000007",
      "id": 47
    },
    {
      "summary": "On the west side of Anniston, Al. As soon as I walked out I noticed a very bright light in the N.  ((Venus?))",
      "city": "Anniston",
      "state": "AL",
      "date_time": "2020-04-25T10:30:00",
      "shape": "circle",
      "duration": "90 min",
      "report_link": "http://www.nuforc.org/webreports/155/S155755.html",
      "text": "My friends and I were standing outside on the west side of Anniston, Al.  As soon as I walked out I noticed a very bright light in the NW part of the sky.  Couldn't be Venus.  I've been looking at these stars for 38 years, from the time it's warm enough to sit outside until it it's too cold.  So, it's fair to say, I can quickly spot what's not supposed to be there.  The light would dim and completely disappear.  Then, it would brighten back up.  I timed the intervals, they were odd..  This lasted for over an hour , until it disappeared Ava never appeared again.  This is the third time I've witnessed something as such.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "33.68382553191487",
      "city_longitude": "-85.76905000000002",
      "id": 48
    },
    {
      "summary": "Chicago Ohare Sighting 4.20.20",
      "city": "Chicago",
      "state": "IL",
      "date_time": "2020-04-20T22:00:00",
      "shape": "light",
      "duration": "2 seconds",
      "report_link": "http://www.nuforc.org/webreports/155/S155932.html",
      "text": "Chicago Ohare Sighting 4.20.20 This is second time writing. First was for Reddit.  -I have told the story SEVERAL times by voice, phone, in person. It has never once changed. I have (during C-VID 19 Lockdown in Chicago) ALMOST convinced myself i didn't see it. But i did.  I was coming home from my parents in the suburbs.  Heading to my place in Chicago where i live.  It was POURING rain the entire 40 minute drive. It suddenly stopped, still bad conditions while i approached o'hare airport. I believe there is an underpass from i90 where ohare is literally above me on the bridge… As i exit this bridge right next to o'hare… i see the.most.beautiful. Shooting star i’ve eve imagined existed. (this is the first millisecond of time broken down) I saw this bright bright light shoot out of my vision. As this millisecond comes to a close, i realize that i saw this light fly AWAY from me. I am a mechanical engineer, i know my coordinate systems extremely well. I can tell you this light traveled up, and away from me (North East Direction). The next slight millisecond of time consisted in me understanding all the sudden that this was NOT a shooting star. It was pouring rain not 5 minutes ago. I look up, the entire sky is covered with rain clouds. They are so presumptuous that they look like their 50 feet above my vehicle. This “shooting star” that i saw i realized left my plane of vision up and away and i still see where it went: a PERFECT horizontal break in the huge rain clouds. This all takes place out of the underpass of o'hare airport. After realizing this light just escaped through that cover, the next millisecond in time is butterflies in my stomach. Because the light i just saw couldn't have been a shooting star given the cloud cover. I realize that i also saw the lights TURN INTO ONE LIGHT. From the close, o'hare type location i first saw it, i saw there were in fact 3 lights and during their exit it formed to one. The butterflies progress. Another millisecond goes by; and i realize the lights are longgg gone. All the sudden my focus comes back, and i see two GIANT jumbo jets flying synchronized, in same exact direction, same exact plane of height of ground that the angle of the lights flew. These planes, giant aircrafts are moving fast i’m sure. But they're moving from my dumb perception slowly as they glide from a take off out of ohare. I line these up in my geometric mind; and i notice they are at the same plane the lights were, and the lights were PERFECTLY CENTERED in between these two flashing airplanes. As if the airplanes perfectly catapulted the lights. Or guided? Or Followed? Around this time i also noticed street lights separating east and west i-90 FLICKERED. Like a perfect trail in direction of that light… Also during this time it hits me of what i just saw. My next move is to call my father. He is a wise realistic man. Straight shooter but absolutely believes in UFO’s. I call him tell him the EXACT description and words i just used to explain this. The very absolute second my story comes to an obvious end. We both hear, a click click clunk and the call drops from us. I call back, thinking perhaps he was messing with me? He thought the same of me. He rushes me off the phone and goes to bed (10:15 ish Pm) He is never like that he was very skeptical.  I think i was confirmed sighting, and they used my phone call as aid in their research whatever is going on. Since this i have just today posted on another website, and all the sudden today there is our USA govt. Releasing old footage of UFOs normalizing them? So now any local stories are blocked by CNN and CBS mentioning the pentagon releasing UFO videos. Also After my sighting 4.20.20 there was a METEOR SHOWER the next day. NIce odds right? Also same week that Elon Musk is sending satteltes out. This was definetly not that hence those need rockets, and this was silent and 50^300032.00290-10 times faster than any light i’ve ever seen.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "41.87991241592284",
      "city_longitude": "-87.66801795521151",
      "id": 49
    },
    {
      "summary": "Triangular object with blue lights on corners, red light in center, viewed with binoculars.",
      "city": "Princeton",
      "state": "IN",
      "date_time": "2020-04-20T03:29:00",
      "shape": "triangle",
      "duration": "7 mins",
      "report_link": "http://www.nuforc.org/webreports/156/S156300.html",
      "text": "Triangular object with blue lights on corners, red light in center, viewed with binoculars. Was outside at 3:20 and at 3:29 noticed funny light moving through the tree outside the back door.  Once it got into a clear view, I noticed it was very unusual, certainly not a normal aircraft nor a drone.  I got the binoculars for a closer look, and noticed it to be triangular in shape with 3 blue/white lights at each point with one larger pulsating red light at the center.  It looked to be up around 15-20,000 ft at approx 45 degrees.  I watched in move very slowly, occasionally picking up speed, then stop to hover, move some more, stop then turned 180 degrees where it stood and moved north to south.  It stopped for 5 seconds, became brighter, and vanished with a speed impossible to follow.  The event lasted 7 minutes, the sky was pretty clear, no moon, no other planes at that time.  I waited for 30 minutes, but no return.  Nothing I know of can take off at that kind of speed from a stand still.  Hopefully, someone may have seen it, too.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "38.33529999999999",
      "city_longitude": "-87.59679999999999",
      "id": 50
    },
    {
      "summary": "High altitude string of spherical objects, traveling single file and spaced about 10 seconds apart.  ((Starlink satellites?))",
      "city": "Colville",
      "state": "WA",
      "date_time": "2020-04-18T20:35:00",
      "shape": "sphere",
      "duration": "10 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155477.html",
      "text": "High altitude string of spherical objects, traveling single file and spaced about 10 seconds apart, crossed the sky from SW to NE. No sounds. Appeared white.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "48.679099999999984",
      "city_longitude": "-117.7527",
      "id": 51
    },
    {
      "summary": "We noticed that what looked like satellites.  ((Starlink satellites?))",
      "city": "Sweet Home",
      "state": "OR",
      "date_time": "2020-04-17T11:00:00",
      "shape": "light",
      "duration": "30 minutes +",
      "report_link": "http://www.nuforc.org/webreports/155/S155413.html",
      "text": "My girlfriend and I was camping up at Green Peter Lake. And as we scanned the night sky, we noticed that what looked like satellites were going from West to East. But then some started going in groups of 2 to 3. And this continued for at least 30 minutes. And at least 200 crafts. The lights never blinked. And not a sound to them.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "44.362200000000016",
      "city_longitude": "-122.69589999999995",
      "id": 52
    },
    {
      "summary": "Single file line of equally spaces lights traveling from West to East.   ((Starlink satellites?))",
      "city": "Sonoita",
      "state": "AZ",
      "date_time": "2020-04-15T21:00:00",
      "shape": "",
      "duration": "30 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155204.html",
      "text": "Single file line of equally spaces lights traveling from West to East. From the west a line of highly elevated lights appeared one by one. They flew East all seemingly from the same starting point. They would glow slowly into view, become bright as the passed of the lights of Tucson, Then to fade as they got farther away. Looking quickly from one end of the single file, equally spaced lane, to The other end, they seemed to be turning slightly north East. As if to loop around Tucson.  We witnesses easily more than twenty. Sometimes breaking sequence, and sometimes multiple single file lines.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "31.759599999999995",
      "city_longitude": "-110.6638",
      "id": 53
    },
    {
      "summary": "MADAR Node 123",
      "city": "Wichita",
      "state": "KS",
      "date_time": "2020-04-13T11:56:00",
      "shape": "",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/156/S156265.html",
      "text": "MADAR Node 123",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "37.69639784853686",
      "city_longitude": "-97.32954010326989",
      "id": 54
    },
    {
      "summary": "REPORT FROM ((name deleted))    5-29-20 DATE OF OCCURRENCE   4-9-20 SIGHTING FROM AIRCRAFT:  PA-31 NAVAJO DESCRIPT",
      "city": "54.690   163.771",
      "state": "AK",
      "date_time": "2020-04-09T10:15:00",
      "shape": "changing",
      "duration": "8 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156776.html",
      "text": "REPORT FROM ((name deleted))   5-29-20 DATE OF OCCURRENCE                       4-9-20 SIGHTING FROM AIRCRAFT:  PA-31 NAVAJO DESCRIPTION AS FOLLOWS:  Geographic Location : Unimak island Alaska  584 NM SW of Anchorage. Mt. Shilshaldin Elev. 9404 above sea level Weather: Clear skies  No wind at 6500 feet Aircraft flying in a SW DIRECTION on a track from 54.945-163.452 to 54.744 164.382  Pilot approaching Mount Shilshaldin on a clear day with no clouds observes nothing out of the ordinary and is watching carefully.  No clouds are visible and flight at this point is uneventful. (PIC 1A)  Strange cloud / Phenomena appears out of no where 54.690 – 163.771 above the peak of the mountain. (PIC 2A)  Object appears to be shrouded in Cloud. Becomes more defined. (PIC 3A)  Shrouded object becomes more defined and appears to have a horizontal vortex trailing from the upper area. (PIC 4A)  Object in relation to Mountain is stationary and becoming more defined. (PIC 5A)  2nd pic of object next to mountain. Something appears shrouded but defined directly below main object (PIC 6A)  3rd pic of object next to mountain (PIC 7A)  As Aircraft moves away from the sighting and glare becomes an issue on aircraft window object begins to change shape. (PIC 8A)  (PIC 9A)",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 55
    },
    {
      "summary": "Driving home with my wife when we both saw  a white circle appear moving quickly across the sky in front of us. It was definitely high",
      "city": "Latrobe",
      "state": "PA",
      "date_time": "2020-03-14T00:40:00",
      "shape": "circle",
      "duration": "25 seconds",
      "report_link": "http://www.nuforc.org/webreports/154/S154646.html",
      "text": "Driving home with my wife when we both saw  a white circle appear moving quickly across the sky in front of us.  It was definitely high in the atmosphere.  Same color/shape as a satellite, but very large compared to any I have seen before, including the ISS.  It was too slow to be a shooting star but too fast to be a satellite.  Object then stopped abruptly and \"hovered\" in place for roughly 5-7 seconds before blinking then rapidly accelerating away.  About 3 seconds after it disappeared an aircraft flew the same exact route as the light as if it was following it.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "40.28369999999996",
      "city_longitude": "-79.38209999999987",
      "id": 56
    },
    {
      "summary": "Human or  Spaceman like object seen slowly floating down from sky, within a few hundred yards from us, landing in a neighborhood.",
      "city": "San Jose",
      "state": "CA",
      "date_time": "2003-01-03T00:00:00",
      "shape": "other",
      "duration": "~5mins",
      "report_link": "http://www.nuforc.org/webreports/156/S156468.html",
      "text": "Human or  Spaceman like object seen slowly floating down from sky, within a few hundred yards from us, landing in a neighborhood. Floating Spaceman/Human figure encounter.  This event happened years ago, around 2003 or 2004 while I was still in high school. A friend and his family had a party/bbq that I was invited to so I stayed the night and was going to get picked up by my parents the next morning. Naturally, being teens we stayed up late, hung out in the garage/driveway playing music, talking & skateboarding. The house was on the east side of our city and on a slope up the hill that gave us a slight view of the city & its lights at night.  Around midnight or 1am, we(my friend and our other friend) were standing outside talking when I noticed a dim lighted object out of the corner of my eye. I turned my head to it and squinted my eyes since it wasn’t in the shape of something I would be used to seeing in the sky. After having a confused face on and trying to figure out if what I was seeing is real, my friends look up and have the same reaction while using certain words to express our confusion.  We saw what we call to this day as “the space man”, an object that looked to be in the shape of a human standing up. While not lit up directly with street lights or anything of the sort, it had a slight glow or inner light to him if that makes any sense but it was very dim and you would only notice a shadow like figure at first until your eyes adjusted. The strangest part was it did not seem that high from us and within the span of 5 mins, it went from maybe a 45 degree angle to us, to floating SLOWLY down behind some trees at the bottom of his driveway and only 2 or 3 football fields away in the neighborhood. After we lost sight we wanted to go down and see where it might have landed but realized that with it being 1am, his parents not wanting us to go anywhere and being on the eastside of our city; any contact with potential officers or concerned neighbors would not be ideal.  We kind of bring it up every once and a while but I never knew where to share this or if others have seen it. I found these two searching the site that are the closest to what we experienced. I also saw a while back that in mexico they are called witches but I am not sure if what we saw fits explanations of those sightings since they tend to actually “fly” and not float or slowly fall like this thing.  http://www.nuforc.org/webreports/064/S64651.html  http://www.nuforc.org/webreports/077/S77040.html",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "37.33884202188921",
      "city_longitude": "-121.88970568835907",
      "id": 57
    },
    {
      "summary": "I just seen like 20 ufo ...they ufo people will tell u it's something else to cover it up .   ((Starlink satellites?))",
      "city": "",
      "state": "IN",
      "date_time": "",
      "shape": "",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/155/S155781.html",
      "text": "I just seen like 20 ufo ...they ufo people will tell u it's something else to cover it up ..believe in what u seen not just that it was some they went other ways ... around the other planets ..that they call stars ...they all went in that one star and that star went in the air higher and higher .... Indianapolis  believe what u seen all or its aye ufo mothership that they went in to then the  mothership went higher and higher until a it disappeared and not only that it's still some flying around that mothership. or the other planet",
      "posted": "",
      "city_latitude": "",
      "city_longitude": "",
      "id": 58
    },
    {
      "summary": "Me and a friend were bow hunting early one morning. We were sitting at the truck getting ready to go into these tree belts  when we not",
      "city": "",
      "state": "",
      "date_time": "",
      "shape": "",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/156/S156152.html",
      "text": "Me and a friend were bow hunting early one morning. We were sitting at the truck getting ready to go into these tree belts  when we noticed these lights on the trees and bushes in front of us  they were little round lights.  I went over to a bush to try and see what it was. But had no idea.  We were a little freaked out so we got in the truck and went down the road about 3 miles to another spot I new we could hunt.  We pulled off the road and behind some trees.  While we were sitting there  out of the corner of my eye I see this craft come up to a tee in the road not 50 yards away it was about 12 ft long and 3 ft wide but round.  With a big light on the front.  We were both looking at it  and you could here it ramp up in sound  and it shot down a mile long shelterbelt in just 2 seconds and the bright light on front just went out  we couldn’t see what happened to it.  At this point  I really didn’t want to hunt anymore.  But we decided to give it a try.  We went down this big gully where it was thick with trees. When we got down in the trees.  Our flashlights went out and the Motorola’s stopped working.  All the bugs stopped making noise it was dead silence.  When all the sudden the fields around us lit up bright as football fields at night games.  We jumped into the bushes to hide. I was on high alert  waiting for something to happen  had my bow ready to go.  And 30 seconds later the lights slowly faded out and our flashlights and Motorola’s came back on  scared the hell out of us.  But here is the wired part.  The next thing I know I’m walking around the back of my truck and my friend is already sitting in the passenger seat looking confused  I have no memory of the time in between our flashlights coming on and being at the truck again I don’t remember the quarter mile walk out of there.  It was no fought the weirdest crap that has ever happened to me in my life.   Thanks for listening to my account",
      "posted": "",
      "city_latitude": "",
      "city_longitude": "",
      "id": 59
    },
    {
      "summary": "It was a disembodied blinking light. At first I thought it was lightning. But the weather was fine. And then I realized, the 'light' wa",
      "city": "New London",
      "state": "WI",
      "date_time": "",
      "shape": "light",
      "duration": "2-3 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155695.html",
      "text": "It was a disembodied blinking light.  At first I thought it was lightning.  But the weather was fine.  And then I realized, the 'light' was holding itself into one mass, that I was just out of eyesight to fully see.  And even though it was bright enough, the light barely extended from a spherical sort of area.  Then it moved. It scared the crap out of me at first.  I mean, it moved!  If I had to explain how it was in another way,  I'd say, 'I saw the lights to a low flying Airplane.'  But if an Airplane was that low, even if it wouldn't crash, I would've heard the loud noise of the engines of the plane.  I do honestly believe that it is something that the government would have a hard time explaining.",
      "posted": "",
      "city_latitude": "44.403299999999966",
      "city_longitude": "-88.7862",
      "id": 60
    },
    {
      "summary": "The object was metallic in color.  Spherical in shape.  Lasted 2 mins about.  ((NUFORC Note:  Contact information is flawed.  PD))",
      "city": "Manning",
      "state": "SC",
      "date_time": "",
      "shape": "sphere",
      "duration": "2 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156924.html",
      "text": "The object was metallic in color.  Spherical in shape lasted 2 mins about",
      "posted": "",
      "city_latitude": "33.61739999999998",
      "city_longitude": "-80.21070000000003",
      "id": 61
    },
    {
      "summary": "2 spheres about a foot apart colliding together and back apart.",
      "city": "Covington",
      "state": "KY",
      "date_time": "2002-04-29T06:00:00",
      "shape": "circle",
      "duration": "1 minute",
      "report_link": "http://www.nuforc.org/webreports/155/S155919.html",
      "text": "2 spheres about a foot apart colliding together and back apart. There were 2 flying spheres flying above my apartment building.  The objects were closer than a plane would be.  The 2 spheres flew about a foot apart and would collide together and back out.  As it flew over the lights flickered.  I watched it until It flew too far into the distance.  Soon after a plane flew by and it looked nothing like the object seen.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "39.06870833333335",
      "city_longitude": "-84.52891822916699",
      "id": 62
    },
    {
      "summary": "((NUFORC Note:  Witness provides no information about sighting.  Date may be wrong.  PD))",
      "city": "Port Hadlock",
      "state": "WA",
      "date_time": "2002-05-19T00:00:00",
      "shape": "circle",
      "duration": "10",
      "report_link": "http://www.nuforc.org/webreports/156/S156553.html",
      "text": "((NUFORC Note:  Witness provides no information about sighting.  Date may be wrong.  PD))",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "48.0047",
      "city_longitude": "-122.7495",
      "id": 63
    },
    {
      "summary": "Lost time at sight of swift moving flaming object that changed shape when moving up and down in the night.",
      "city": "Muddy River",
      "state": "MA",
      "date_time": "",
      "shape": "changing",
      "duration": "2-3 hours",
      "report_link": "http://www.nuforc.org/webreports/157/S157113.html",
      "text": "Lost time at sight of swift moving flaming object that changed shape when moving up and down in the night. In the records of the Massachusetts Bay Colony, Governor John Winthrop reports the sighting in the year 1639 in the History of the Massachusetts Bay Colony, pg 294.  “In this year one James Everell, a sober, discreet man, and two others, saw a great light in the night at Muddy River. When it stood still, it flamed up , and was about three yards square; when it ran, it was contracted into the figure of a swine: it ran as swift as an arrow towards Charlton, and so up and down about two or three hours. They were come down in their lighter about a mile, and, when it was over, they found themselves carried quite back against the tide to the place they came from. Divers other credible persons saw the same light, after, about the same place.”",
      "posted": "",
      "city_latitude": "",
      "city_longitude": "",
      "id": 64
    },
    {
      "summary": "USAF pilot cadet encounters a UFO while on a night instrument training flight.",
      "city": "Dugway",
      "state": "UT",
      "date_time": "",
      "shape": "",
      "duration": "",
      "report_link": "http://www.nuforc.org/webreports/156/S156764.html",
      "text": "USAF pilot cadet encounters a UFO while on a night instrument training flight. An old Fighter pilot’s late report..  ((name/rank deleted))l. USAF (Ret)    5/29/2020  When the Korean war began in June 1950 I was about to enter my 3rd year of college at the University of New Hampshire..  But the local draft board’s decision to call me up led to my having to enlist in the USAF in December 1950 while completing my application for pilot training..  I was sent to Lackland AFB in San Antonio, TX for basic training and the completion of my application for the Aviation Cadet program.  Having been accepted, I was them sent to James Connally AFB in Waco, Tx to work on their T-6 trainers pending selection for flying school class. I was selected in November 1951 for pilot training in class, 52-H and was sent to Hondo, TX, to begin the Cadet program, which I completed and was then transferred to Williams AFB in Phoenix, AZ to complete my Aviation Cadet program and get my wings. .T-6’s and F-80 jets were used at Williams to train pilots. While we were scheduled to complete training in December 1952 in Class 52-H, I was delayed in my training by contracting a local ailment known as “Valley Fever”- a lung infection which put me in the hospital to recover for 10 days—thereby forcing me to be moved back to the next  flying class, 53-A as I had fallen behind on school work and flying. This class then graduated from Williams AFB in February 1953. The event which I am about to relate occurred during one of my last flying missions in either December 1952 or January 1953 and involved a night instrument flight check on a cross-country from Williams Field to Hill AFB,  Utah, then to Nellis AFB Nevada and return to Williams AFB at night.  I was assigned an instructor pilot to conduct the check ride – but he was someone that I was not acquainted with. The instrument Check ride necessitated the use of a coated canvass hood to cloak off  the rear cockpit that could be slid into place such that it blocked any reference to outside the cockpit or horizon, simulating flying in solid weather conditions.  It is effective.  Just after takeoff from Hill AFB, I went under the hood and began flying the two place T-33 up to altitude and down the airway to Las Vegas.  This was not a difficult process and the red lights of the instrument panel were the only lights in use, as other lights are damaging to night vision. As we proceeded down the airway at 30,000 ft passing by Wendover and Dugway Utah proving ground/sites, my cockpit began to brighten up as if my internal lights had been turned on. I asked the check pilot if he was turning up my white lights and he said, “No, Come out from under the hood and look up to the right.” I slid the hood forward and what I saw passing by was the reason that my cockpit had begun to brighten up—a massive, glowing airship shaped like a reddish fat cigar was passing by us about 2000 feet above and  a mile or so distant. It had five distinct rows of what seemed like portholes or reddish colored windows while the rear appeared to be a bit diffused.  Its glowing appearance brightened up the area around it and the light had penetrated the hood under which I had been flying.  I estimate that it was a large as several battleships. We both were in such shock at seeing this huge ship that we did not speak to each other for some few minutes and watched as the ship made a right turn and remained off as a distant light—which we then flew past.  The IP made a call ahead to Nellis AFB to alert them as to what we had just experienced –we were advised to call the local intelligence office upon landing.. We did so and spent an hour with them at Nellis  AFB answering questions. We refueled and continued on home to Williams AFB, AZ.  This was one of my final flights as an Aviation Cadet as we were all shortly commissioned and got our wings. Most of us proceeded on further to gunnery training at Nellis AF and  continued flying both the old F-80 and then the F86 enroute to Korea.  But several days before we were to depart Nellis, our assignments were cancelled and a number of us were sent to form a new squadron at Hamilton AFB, CA. I stayed there for less than one year and was then sent to the 18th Fighter wing in K-55, Osan,  Korea. The incident with the huge UFO was forgotten and almost never came to mind until years later when my old class, 52-H had their 50th reunion at an old downtown hotel in San Diego, CA. While there, I mentioned the incident to a classmate, ((insructor pilot's name deleted)) but I could not recall who was  the Instructor pilot who conducted the check flight had been…But in describing him to Michael, as a black who was very light skinned and a trimmed  mustache, Michael said that that was his old flight instructor, ((name deleted)).. He was then living in Walnut Creek CA. just above Oakland. He later sent me ((instructor pilot's name deleted)) telephone number and I called him a week or so later. His wife answered the phone and said that ((instructor's name deleted)) was not there at the time, but then asked, what was it that I wanted to discuss? I told her about the night instrument flight check so many years ago and she said she would pass this along to her husband.  And to call back later. Which I did after several days and again, she answered the phone…When I told her who I was, she said that ((instructor's name deleted)) did not want to talk to me—which surprised me, but I persisted and finally he came to the phone. His first comment was, “Don’t you remember that we signed some papers to never talk about what we had seen”? I said no, that I could not recall signing anything but also noted that I had said very little about that incident over the years. Then ((instructor pilot's name deleted)) said, “Then you don’t know all of the story.  After we got back to Williams field, the next morning the staff duty officer called me at home and told me that the Wing Director of Operations wanted to see me asap in his office.” “I went there and saw that two men in black suits and hats were sitting there with the D.O. . They  moved me into another room and for the next three hours, grilled me as if I was a criminal, insisting that we has not seen any such thing, and that we were not to ever mention it.” ((instructor pilot's name deleted)) then spoke about his subsequent experiences with these two men. He said that one of them would appear suddenly, as if checking up on him over the years as a warning it appeared.  When ((instructor pilot's name deleted)) was assigned to fly with the Air America crowd during the Vietnam war, into Laos, etc., on one mission he needed a Flight engineer, and when he showed up, it was one of the two black suited men from long before…((instructor pilot's name deleted)) refused to let him fly with them. Of interest also, is a TV program which was run by the late ABC Television newscaster, Peter Jennings. Several years before he passed away, Jennings had a 2+ hour TV show about UFO’s which included a number of former military pilots, airline pilots and others who had experienced similar incidents with UFO’s… While watching the show, one airline pilot was describing his sighting of a “cigar-shaped” ship. He went to a blackboard and drew the exact shape of the ship with we had witnessed so many years earlier, including the lighted windows and diffused rear, and the glowing brightness of its hull.. Confirmation of our sighting as well.. Of interest also, is another event over which I have no knowledge or recall.. About 10 years ago, I suffered from a bit of vertigo and my Dr. suggested getting a CT Scan of my head… When this was done, the technican came out to tell me that I had a bb sized something at the top of my head…She gave me the disc which I put into my computer and there it was—a bright white object that I do not know what it was or how It got there…Later, I discovered another hard round object under the skin of my right wrist… And as regards other flying missions, I know that some have been monitored by Divine eyes, as how I managed to avoid termination, had to come via Divine intervention.",
      "posted": "",
      "city_latitude": "40.323599999999985",
      "city_longitude": "-112.79749999999996",
      "id": 65
    },
    {
      "summary": "Abductions starting at age 3 or 4.  Reocurring distortions of time/space",
      "city": "Davis",
      "state": "CA",
      "date_time": "",
      "shape": "",
      "duration": "30 seconds?",
      "report_link": "http://www.nuforc.org/webreports/156/S156880.html",
      "text": "Abductions starting at age 3 or 4.  Reocurring distortions of time/space This was not a craft sighting, it was an abduction. I saw 4 of them and \"spoke\" with one of them.  They were returning me to my bed and I woke up too soon.  I knew that I wasn't supposed to do that and got scared. The one that I \"talked\" to comforted me and told me to remain calm with my eyes closed.. but I just HAD to open my eyes and look. I was floating towards my bed, being returned to my bed. There was 4 of them, 1 by the door and 3 around my bed. There's so so much more to tell... It's happened 3 times (each very different)that I can vividly remember. I am now 58 years old and feel the need to tell my story but I don't know where to tell it. Is this the place?",
      "posted": "",
      "city_latitude": "38.48522499999997",
      "city_longitude": "-121.64357625000044",
      "id": 66
    },
    {
      "summary": "3 orbs over Loring AFB.",
      "city": "Loring",
      "state": "ME",
      "date_time": "",
      "shape": "sphere",
      "duration": "60 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156509.html",
      "text": "3 orbs over Loring AFB i am filing this on behalf of a deceased friend who confided in me before his death.  Sometime in spring/summer 1966 he was an MP at Loring AFB.  He was on patrol with another MP and they were at the top of a hill when 3 orange glowing spheres he estimated about 50 feet wide and same in height passed over the base in formation about 30 mph.  They followed the spheres until they passed out of view from their jeep.  Later that day he was friends with a fighter pilot on the base.  The fighter confided that fighters had been scrambled armed with missiles to chase the objects.  The pilots tracked the spheres into Greenland where they then shot up at unimaginable speed at a sharp 90 degree angle and out of view in the blink of an eye.  The pilot told my friend who was 18 at the time that the pilots were briefed not to mention anything and forced to sign secrecy agreements.  I am leaving his name in the contact section.  No sounds or exhaust were observed from the spheres and ! no aggressive actions.",
      "posted": "",
      "city_latitude": "",
      "city_longitude": "",
      "id": 67
    },
    {
      "summary": "Multiple lights 9:00 PM Omaha",
      "city": "Omaha",
      "state": "NE",
      "date_time": "",
      "shape": "formation",
      "duration": "5",
      "report_link": "http://www.nuforc.org/webreports/155/S155844.html",
      "text": "Multiple lights 9:00 PM Omaha I was stargazing, using a new app that identifies celestial objects at approximately 9:00 p.m..  Looking toward the south but nearly straight up I glanced behind my phone screen to see the actual sky.  At that moment I noticed multiple movements but went to the phone screen to see if it was something natural, meteor shower etc.  Nothing was identified through the app so I trained my eyes to the activity above, spanning front to rear of the moving lights it would seem to be a direction from Norfolk to Kansas City.  The total distance, hard to estimate, could have been that same span from city to city.  I looked back forward and began counting, as I hit around 36 I looked back to the origin amazed at how many I was counting.  The origin seemed to give the illusion of balls (lights) coming from the end of a tube that was not visible.  It could also be an effect caused by the proximity to the moon.  From where I viewed, near 156th and Harrison in omaha, the orig! in at that time in reference to the moons position seemed about 8:00 o'clock.  I failed to get an accurate count but estimate between 36-40.  All flying single file, at times it seemed varying speeds to one another but never overtaking.  That grouping passed comparatively to what I'd expect a commercial plane takes overhead.  About 10 minutes or so after the first grouping there were two more, following same path and estimated same speed.",
      "posted": "",
      "city_latitude": "41.25485179600818",
      "city_longitude": "-96.0648278492242",
      "id": 68
    },
    {
      "summary": "We were living in Port Orchard, WA, at the time, in the neighborhood of Parkwood. It was the night before Thanksgiving, when my twin an",
      "city": "Port Orchard",
      "state": "WA",
      "date_time": "",
      "shape": "oval",
      "duration": "1-2 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156442.html",
      "text": "We were living in Port Orchard, WA, at the time, in the neighborhood of Parkwood.  It was the night before Thanksgiving, when my twin and I were around 8 or 9 years of age, so it would have been around 1967 or so.  The reason I remember it was the night before Thanksgiving was because a family member was over helping our mother prepare food for the next day.  We were told to go get ready for bed. We walked into our bedroom and looked out the window.  We were always doing that; it drove our parents crazy.  We were always looking out the windows at night; weird...anyway, we hadn't even turned on the bedroom light.   Across the street, next to the top of a large evergreen tree, were two oval shaped blue lights, next to each other.  They only stayed for a second or two and then shot upward and over our house, almost as if they did not want to be seen.   We were so scared!!  We ran from our bedroom and tried telling the adults about it, but being busy, our concern was prett! y much dismissed.  We were told we were seeing things and the matter was dropped. We were pretty shaken.  At that age I had no idea about dimensions, height etc.  All I remember were two glowing blue lights that disappeared almost suddenly.  We had never seen anything like it.",
      "posted": "",
      "city_latitude": "47.512492746114",
      "city_longitude": "-122.61571813471487",
      "id": 69
    },
    {
      "summary": "Huge Glowing, hovering red ball descends from sky.",
      "city": "Milford",
      "state": "MA",
      "date_time": "",
      "shape": "sphere",
      "duration": "15 seconds",
      "report_link": "http://www.nuforc.org/webreports/156/S156660.html",
      "text": "Huge Glowing, hovering red ball descends from sky. I was eight years old, going from my family home to a cookout next door.  There was a large meadow behind our house, separated from the lawn by a small strip of forest.  I was facing the meadow as I left my house, and the people at the cookout were seated in a small semi circle, facing the houses rather than the woods.  I heard a soft “whoosh” sound and saw a bright red ball rapidly dropping straight down from the cloud cover.  This was instantaneous, and next I saw that it was actually very large, almost the size of the entire meadow.  It was a bright red ball that seemed to glow from within, and through the trees I could see it was hovering perhaps 1-2 yards from the ground.  It appeared translucent and hovered for a few seconds, before whooshing straight up, back above the cloud cover.  The whooshing sound was so soft it was barely audible.  After this, the object was completely gone.  None of the people at the cookout saw this.  I was the only witness, a! nd after being transfixed by what I had seen, I also realized none of the adults would believe me and kept what I had seen to myself.  I never forgot the sight of this incredible red glowing ball, and I will always remember the sense of awe that I felt.  This is the first time I have documented this.",
      "posted": "",
      "city_latitude": "42.13979999999994",
      "city_longitude": "-71.51620000000001",
      "id": 70
    },
    {
      "summary": "Ref Shere Observed In 1968.",
      "city": "Memphis",
      "state": "TN",
      "date_time": "",
      "shape": "sphere",
      "duration": "10-15 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156783.html",
      "text": "Ref Shere Observed In 1968. I turned 21 years old on August 3rd of that year, which was a Saturday.  The next Friday, August 9th, a friend wanted to take me out to a local pub for my first “legal” beer.  He came over to my duplex near the University to pick me up about 8:30 that evening.  It was almost dark when we left my house to walk to his car, which was parked on the street and facing South.  There were low, thin scattered clouds that evening.  So low that they were illuminated by the ambient light of the street lights, neon signage and automobile lights of the area.  As we walked  Eastward down my walkway to the street, I saw a red light streaking from the Southwest, skimming the clouds and illuminating them from above, turning them pinkish.  What really caught our attention was the speed of the object and the fact that there was no sound associated with it.  It simply stopped like it had run into a brick wall when it was due East of us.  Still no sound of any sort.  It started “pulsing”, then made a small circle.  When it was moving it didn't pulse.  It stopped and started pulsing again, then made a another small circular maneuver.  We watched it repeat this for several minutes, and were joined on the sidewalk by three US Navy personnel who were stained at the Naval Air Station at Millington, TN, who watched dumbfounded.  As we all stood there, it started pulsing faster and faster until it was a constant red, then it shot away like it was fired from a cannon.  It was literally gone from view in a second, and seemed to be receding, as if it was moving away from us at an angle.  What size it was is difficult to say because there was no point of reference or scale.  It's apparent size was like a piece of bird-shot held at arm's length.  Just a glowing red sphere with no discernible features, and never made a sound.  The Navy guys started arguing among themselves about what they had just seen , and one of them went inside to call the air station, but he said all the lines were jammed when he came back.  I don't know what it WAS, but I can tell you what it WAS NOT.  It wasn't an airplane or a helicopter.  It wasn't a Chinese lantern or the planet Mars or swamp gas or any other darned thing.  The names of the Navy guys are lost to history, and my friend has always refused to discuss the incident ever since that evening.",
      "posted": "",
      "city_latitude": "35.12547266265736",
      "city_longitude": "-89.9269248223065",
      "id": 71
    },
    {
      "summary": "On the evening these events took place, I had just arrived at my mother's house off Hwy. 78 in a little subdivision close to and across",
      "city": "Summerville",
      "state": "SC",
      "date_time": "1969-06-30T19:00:00",
      "shape": "circle",
      "duration": "10-15 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156040.html",
      "text": "On the evening these events took place, I had just arrived at my mother's house off Hwy. 78 in a little subdivision close to and across the highway from Berlin G. Myers Lumber Co.  Not long after arriving I heard people talking loudly and with excitement just outside of the house. When I went to the door there were about 15 or 20 neighbors looking and pointing at something in the sky above the subdivision. I went onto the porch to investigate and sure enough there was some sort of craft hovering slowly high in the sky as if it was looking for something. I ran in the house to get my driving glasses and when I returned the craft was so low  I swear you wanted to reach up to try to touch it. It was huge and ominous looking. It was shaped like your everyday 'Flying Saucer' medium colored gray flat metal construction. As it continued to silently hover over our heads, a relatively small compartment slowly descended from the middle of bottom of the craft... there were lights in it but I couldn't see any occupants. Everyone was spellbound and silent. All of a sudden and without warning it disappeared in an instant....and immediately a military looking helecopter came swooping in so close & fast over our houses, we ducked in panic. The chopper circled the area quickly once and headed off toward the airforce base. Personally I'm not prone to believe in a future allien invasion...we have enough acting like that down here already, but I know what we all saw and quiet honestly I'm glad I am able to share the experience even though it has been about 50 years ago. God bless and keep looking up!!!",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "33.031396402877775",
      "city_longitude": "-80.1881230215825",
      "id": 72
    },
    {
      "summary": "Telepathic thought implantation by alien beings aboard an Unidentified Flying Object.",
      "city": "Bennington",
      "state": "VT",
      "date_time": "1970-06-01T12:00:00",
      "shape": "disk",
      "duration": "6 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155767.html",
      "text": "Telepathic thought implantation by alien beings aboard an Unidentified Flying Object It was a clear day with bright sunshine, and without any wind.  I was ten years of age in a rural area in the town of Bennington in the state of Vermont.  My parents were in a shoe store shopping.  A young girl, about my same age, joined me in walking about two blocks into a grassy field. She was a fiend of the family.  We were talking between each other when we both simultaneously turned to our left and noticed a metallic disc shaped object hovering motionless in the distance about ten feet off of the ground.  There was no mistaking what it was, and we both knew that it was an Unidentified Flying Object.  There was no misinterpretation of the event.  I immediately became enthusiastic, and so did this other witness.  I instructed her to go to the shoe store and alert the people inside to come out and see this.  After she had left the area, I was completely alone with the alien craft.  I watched it as it proceeded slowly towards me, and stopped to hover motionless about forty feet away and about ten feet off of the ground.  I was alone with this alien craft for about one full minute during this time.  There was no physiological or psychological sensation during this time: I did not realize until later on in my life that a telepathic exchange was occurring with the alien beings that were aboard the Unidentified Flying Object.  This will be described in greater detail later.  I never saw one of the alien beings, and nor was there missing time or the possibility of abduction.  The timeframe of the conscious comprehension of the event was consistent to this day.  After that one minute alone with that alien craft, it exited into the sky in non-ballistic motion faster than the eye could follow and was gone.  I returned to the shoe store before anyone else had been able to come outside to witness it.  This was an event that changed my life for the rest of my life. For over forty nine years now I have been awaiting an understanding of the purpose for th! at encounter.  I had genius quotient at such a young age, and these beings took exception to me to accomplis h an objective that was known only to them that fulfilled a purpose of benefit for society. These alien beings are a highly advanced and complex intelligence from other planets that are capable of the psychic exchange of thought processes between them, and are also capable of helping people to become aware of how to understand how this process works for themselves.  The complexity of this interaction exceeds our comprehension.  Psychic channeling of this authority through a discourse is different from telepathic thought implantation:  The wonder that surrounds genuine psychic phenomenon has intrigued some of the most well regarded minds in the country, both theological and scientific.  I did not even realize it as I was growing older, as it just seemed to me to be natural, but these same alien beings were guiding me at first to become psychic, and then to differentiate myself from this process which permitted the conscious ability to watch th! is unfold.  At first I could consciously watch this process, and then over the years I learned to trust an increasing level of a complexity that exceeded me, but without the fear of being overwhelmed by what was happening to me and other people. I could analyze the end result, and my uncertainty of a trust, which was a guidance to understand the fear of other people, began to decrease over time. This is what the purpose of that telepathic thought implantation at the age of ten in that encounter was for:  Those alien beings, and others like them, were preparing people that were ready and receptive to be able to trust the benevolence of these beings that had become constrained by the requirements of military security that surrounds the alien phenomenon.  It required a great deal of time and deliberation to correlate how my personal experience with this phenomenon became a means to help other people, whether conscious of their experience with alien beings or not, to incorporate into their lives a decrease of the fear of the unknown that the! se highly evolved life forms represent. It is a great enigma that humanity is confronted with:  How little that we know about these alien beings so as to not overwhelm people with the fear of the unknown has culminated in not being able to extend that trust in a more complex and evolved intelligence that is benevolent.  Theological interpretation will not be enough.  There is an immense void of a need in the human condition for a sustainable future in the face of great adversity that seems to destroy the planet faster than it can be saved.  These alien beings can provide that structure in the collective of human consciousness as to how to achieve that future that humanity has been unable to do for itself.  Life evolves other intelligent life in the universe, and the vast majority of people are receptive to this change.  There should be no fear of an alien mind control: In an analogy, the complexity of subliminal programming by these alien beings exceeds human comprehension despite all of ! the modern scientific advances in computerization and technology.  The factor of life force, as a creation of God, exceeds any barrier by the physical reality.  Miracles are commonplace in the universe.  Life is a miracle, and these alien beings can manifest these miracles in their domain once humanity can extend that trust in a more highly evolved and complex intelligence than the human race can comprehend until that trust is extended.  It is an infinite and timeless universe out there, with an infinite living force of all creation.  These alien beings await humanity to become a part of what the universe has to offer.  Humanity will evolve, as it is all a matter now for people to accept the common humility before God with these alien beings that will help to guide us into that synchronicity. ((NUFORC Note:  We find we are in agreement with much of what is said above!  PD))",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "42.862599999999965",
      "city_longitude": "-73.09979999999997",
      "id": 73
    },
    {
      "summary": "UAP near DT Chicago along Lake Michigan",
      "city": "Chicago",
      "state": "CA",
      "date_time": "1970-06-01T16:00:00",
      "shape": "circle",
      "duration": "2 Minutes",
      "report_link": "http://www.nuforc.org/webreports/154/S154989.html",
      "text": "UAP near DT Chicago along Lake Michigan I was at my Parents 18th floor Condo (Lake Point Towers) overlooking Lake Michigan & Navy Pier, when their dog started barking frantically in the next room.  As this was quite unusual to hear, I ran in to see what the fuss was about. There I observed in the very large floor to ceiling picture window, a flat, spiral, circular, one dimensional, electric-like 60hz humming, very brilliant white circular light @ 10meters in diameter and only 5 meters away from my window vantage point.  The ‘flat disc’ descended slowly and closely along the high rise floors of the building and I watched it travel to about 30 feet above the ground and shifted path to fly over Lake Michigan where I lost sight as it went beyond my sight of view. I immediately ran downstairs to confirm its location, but object was nowhere in sight and the doorman told me he did not see this object. Although many years have passed, this UAP experience was life changing and the memory stays with me to this day. Note: I was reminded of my sighting from your recent post of: Occurred : 9/21/2019 23:13 (Entered as : 9/21/2019 23:13) Reported: 9/30/2019 11:10:28 AM 11:10 Posted: 10/4/2019 Location: Gallipolis, OH Shape: Circle Duration:8 seconds",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 74
    },
    {
      "summary": "\"Flying Saucer\" nightmare with unexplained noises.",
      "city": "Port Orchard",
      "state": "WA",
      "date_time": "1971-08-15T01:00:00",
      "shape": "unknown",
      "duration": "3-5 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156441.html",
      "text": "&quot;Flying Saucer&quot; nightmare with unexplained noises My next story is strange; not exactly a sighting, but a strange circumstance, and you can decide yourself about it.  My twin sister(fraternal) and I were maybe 12 or 13 y.o. but no older than 14.  We didn't feel like putting the clean sheets on our beds one day, so with our parents' permission we decided to sleep out on the hide-a-bed in the living room.  We thought it would be great fun.  There were folding doors that closed off the living room from the dining room and family room.  At that time, there was no carpet in those areas. I woke up because my sister was shaking, scared to death.  She told me that she had been dreaming a 'flying saucer' was chasing us around the house.  We would run from room to room and it followed us.  We looked out the family room sliding door and there it was.   When we ran to the living room it circled around to that side of the house.  She woke up from the dream and told me that something big had hit the garage door so hard the screen! door by us had rattled.  I hadn't heard a thing, so was trying to calm her down and tell her it was just part of the dream.  What happened next is something that my sister still doesn't like to talk about,  Something started running around on the other side of the folding doors; or at least, that's what it sounded like to us.  Like a child wearing patent leather shoes was running around the dining and family rooms. We were petrified, could hardly breathe.  I wanted to get up and run get our parents, but I was afraid that something would grab me when I ran by the kitchen, so we just lay still and held on to one another.  I don't know how long it lasted, but Paula suddenly sat up and yelled, \"What is it?\"  The noise instantly stopped.  It doesn't make sense at all, but we apparently just went back to sleep. Also, our cat never moved during the entire episode.  The next day we got up the nerve to tell our mother about it.  With hindsight, I think she was trying to make us feel better, because she brushed it off and said that we were imagining it.  When I asked her how two people can imagine the same thing at once, she had no answer.  Our older sister was at the table and then men! tioned that she had heard something during the night, but just assumed it was the \"twins\" up messing around.  Weird things just seemed to happen to us. ((NUFORC Note:  Please see other report from same witness for Port Orchard, WA, for the date of November 01, 1967.  PD))",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "47.512492746114",
      "city_longitude": "-122.61571813471487",
      "id": 75
    },
    {
      "summary": "Watched what I thought was a satellite make an abrupt right angle turn and vanish withing 2-3 seconds.",
      "city": "Burnett",
      "state": "TX",
      "date_time": "1974-05-15T01:00:00",
      "shape": "other",
      "duration": "2-3 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156181.html",
      "text": "Watched what I thought was a satellite make an abrupt right angle turn and vanish withing 2-3 seconds. I heard on Coast to Coast on May 2020 a request for UFO sightings even if they are decades old.  For the record, this sighting happened in late Spring, 1974. My husband and I were camping at Inks Lake State Park in Burnett, Texas.   We were in separate sleeping bags, and I awoke during the night to find the temperature had dropped, and it was uncomfortably chilly.   Having trouble getting back to sleep due to the cold, I took advantage of an amazingly clear night sky with its millions of twinkling stars.  I soon noticed what I thought was a satellite moving ever so slowly across the sky.  However, it soon made a very abrupt right angle turn and streaked across the sky and vanished in no more than 2-3 seconds.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 76
    },
    {
      "summary": "Red metallic object,seen above the tree line, stationary in the sky.",
      "city": "Bothwell",
      "state": "ON",
      "date_time": "1974-06-01T14:00:00",
      "shape": "other",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155175.html",
      "text": "Red metallic object,seen above the tree line, stationary in the sky. In the summer (I don’t remember which month) of 1974 about 20 miles or so North of the farm where I grew up in SW Ontario, my fiancé and I, along with another couple were out for a Sunday drive along a popular scenic back road, that ran along one of the county rivers. The fellas were in the front and myself and my friend were in the back.  I was talking to my friend, and past her, out her window, I saw this huge red thing in the sky, just over the tree tops. It was just sitting there like it was parked. I mumbled something like “what is that?” and my friend looked in the same direction and she mumbled pretty much the same thing.  We couldn’t take our eyes off it.  I don't know how long we looked at it, but because we were still moving down the road, after a while it became obscured by the trees along the river and we couldn’t see it anymore. My friend and I yelled “stop” and asked if we could back up? We kept backing up to where we thought we saw it, but the object was nowhere to be seen.  We thought the guys up front were seeing the same thing but it turned out they were oblivious to our conversation and didn’t see a thing.  I confirmed with my friend exactly what she saw and she saw the same thing I did.  It was big, and red and looked dirty, like rusting iron. It was not smooth, but had angles and shadows that looked like big doors.  On the side of it near the back, there was a round hole and from helping my Dad fix farm machinery, I remembered thinking that must be the exhaust, because there were black smudges running down, underneath the hole.  I guess because they didn't see it, the guys teased us relentlessly so we just shut up about it and haven't spoken since about it.  If anyone else has seen something similar, it would be good to know.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 77
    },
    {
      "summary": "Recalling my first UFO sighting....1976",
      "city": "Muskego",
      "state": "WI",
      "date_time": "1976-11-01T18:00:00",
      "shape": "light",
      "duration": "1 minute",
      "report_link": "http://www.nuforc.org/webreports/157/S157114.html",
      "text": "Recalling my first UFO sighting....1976 (Uncertain of date, estimating fall since we had clear view of nearly the entire lake)  It was dusk. A clear starry night was ascending upon 3 teenaged cousins who were just cruising around listening to tunes, in a Chevy Impala.  The sunset was behind us as we turned in an easterly direction, up the hill from Highway Y on Lochcrest Blvd., toward the house on Little Muskego Lake, located in S.E. Wisconsin.  As the driver (my cousin) crested the hill, we could see the hazy glow of Milwaukee's city lights to the north east, as well as the house lights that dotted the shoreline all around the lake. I don't recall Muskego's Dandelion Park ferris wheel being illuminated, which again makes me guess this may have been later in the year, when the park was closed for the winter.  The driver (my cousin) stopped the vehicle abruptly, pointed to the the sky above the lake and yelled \"WTF is that?!!!\"  The three of us saw an intense bright white orbital light (close to blinding intensity), hovering about 200' to 500' above the south end of the lake.  Suddenly, the orb light traveled at extreme speed to the far north end of the lake (distance is about 1 mile). Then the light maneuvered instantly up, down, back and forth across the lake, precisely halting it's movement at several different locations.  There were no trails or smoke of any kind behind it.  The orb hovered for a few seconds over the south end of the lake directly in front of us before shooting straight up into black space.  We were awe struck by what we had just seen! My cousin quickly drove down to their home on the lake. The three of us ran inside the house to tell our parents about the sighting. I'll never forget the sound of the door hitting the wall so hard as we barged in, that it made a hole in the wall. My uncle was angered by the damage we caused the wall, and refused to hear a thing about our incredible sighting. He wrote us off.....saying we were probably smoking wacky weed.  We know what we saw that night was real.  There were several documented UFO sightings in Wisconsin, the USA, and other locations on Earth during that time period.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "42.877599999999966",
      "city_longitude": "-88.13379999999992",
      "id": 78
    },
    {
      "summary": "Red, glowing circle over mountains of North Georgia",
      "city": "Hiawassee",
      "state": "GA",
      "date_time": "1976-12-24T21:00:00",
      "shape": "circle",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155962.html",
      "text": "Red, glowing circle over mountains of North Georgia The large red, glowing craft was silently moving across the sky about 100 yards above the ground.  The craft moved behind a small mountain and disappeared.  For years after the encounter, I would have incidents until around the age of 16.  Then, I got to see something, being, in my room.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "34.8915",
      "city_longitude": "-83.68609999999998",
      "id": 79
    },
    {
      "summary": "Lights in formation, stopped, changed formation, then continued along their previous direction.",
      "city": "Albuquerque",
      "state": "NM",
      "date_time": "1977-07-15T22:00:00",
      "shape": "formation",
      "duration": "less than 1 min.",
      "report_link": "http://www.nuforc.org/webreports/156/S156209.html",
      "text": "Lights in formation, stopped, changed formation, then continued along their previous direction. Mid-July 1977 / 10p / clear skies I had just graduated from HS, sitting at a local, Neighborhood Park in the Northeast Heights of Albuquerque, NM.  I was contemplating my collegiate future, looking up at the clear, dark sky. I have since told this story many times since that night, and it never changes.  What I saw was both startling and intriguing.  These five lights (about the brightness of one of the brighter stars in the big dipper) appeared in the SE night sky, traveling North by Northeast.  They formed a straight line in relation to my view, but at 30 degrees from the horizon, equidistant apart, just less than the length of my thumb as I held it up to the sky.  I first saw them at about 3 o’clock to my far right.  Their speed was constant, until they all stopped at once, after traveling just over an arm’s length (elbow to fingertip) in only 3-5 seconds. I initially thought they were helicopters, but convinced myself they traveled too fast to be ‘copters. They must have stopped for 2-3 seconds, maintaining the straight line.   What happened next gave me goose bumps.  One by one, while still in that straight, diagonal line, they made crisp, sharp 90 degree turns, changing their alignment to a V-shape formation.  This occurred in about 5-7 seconds.  Once in a V-shape, they maintained stationary for another 3 seconds or so, then continued at their previous speed in the same North by Northeast direction.  I watched them for another few seconds until they were out of sight. I am now a respected engineer and still look to the sky, convinced UFO’s are real, with the only question being where are they from and who are they.  Perhaps us, from the future?  We used to ask about disclosure.  It already happened, and we never really noticed!  We’ve become pre-occupied with our own lives, and concerns about such things as COVID-19.   UFO news is no longer intriguing or curious.  Most people acknowledge their presence, but also inquire about contact.  Actual contact is the next logical step.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "35.10348122192229",
      "city_longitude": "-106.61247515723309",
      "id": 80
    },
    {
      "summary": "UFO fly's over houses and lands a couple blocks away in a school baseball field.",
      "city": "Salinas",
      "state": "CA",
      "date_time": "1978-06-30T17:00:00",
      "shape": "disk",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/154/S154722.html",
      "text": "UFO fly's over houses and lands a couple blocks away in a school baseball field. I was outside playing with my dog and it flew over my street Toro Blvd. towards the school down the road. I ran in told my mom and we walked together down to the school, the whole time my dog was going nuts I remember I could barely hold him, when we got there it was gone but it left a burnt smell and apparently where it landed it left a ring around the school field where it landed. I remember it clearly. The ring was incredibly big meaning the craft was big..guessing at the size now 40 years later I'd say it was 100 ft in diameter, was a perfect circle and was still warm to the touch. When it flew over it had blue to greenish lights underneath it and thinking about it now because I was young it could have been it's propulsion emiting the colors. It was only above the roofs of the houses by about 20 feet if that. It was close enough you could hear it. For lack of a better word it sounded Sonic, metallic whistle? Hard to explain and more people than me had se! en it that day. I remember people standing in the street looking the direction of the school. There was actually a Salinas newspaper clipping that my mom saved for years talking about the UFO sighting. Many people seen it that day but I don't see any mention of it anywhere now. Must of been real otherwise we would see media on the sighting. It can be hidden from the people but I know what I seen and will never forget it.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "36.688524576271284",
      "city_longitude": "-121.62845480225971",
      "id": 81
    },
    {
      "summary": "I saw a ball, off white, irregular borders similar to a fireball. It circled the area a number of times. Then, the object began to slow",
      "city": "Saugus",
      "state": "MA",
      "date_time": "1979-07-10T21:00:00",
      "shape": "changing",
      "duration": "1 hour",
      "report_link": "http://www.nuforc.org/webreports/154/S154667.html",
      "text": "I saw a ball, off white, irregular borders similar to a fireball.  It circled the area a number of times.  Then, the object began to slowly approach where I was.  As it did,  the shape changed.  Now it was a flat pie plate kind of shape.  It hung in the area, hovering over at maybe a 45 degree angle.  It was dark on top and light on the bottom  Then, it started to move away again, changing back into the roundish shape.  Circled around one more time, then it appeared to descend.  And it was gone. I know it was a Friday, starting about 8pm, in summer. Donny and Marie was on TV, so that's how I estimated.  Lol",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "42.467500000000065",
      "city_longitude": "-71.01310000000007",
      "id": 82
    },
    {
      "summary": "Close up with a UFO",
      "city": "Springfield",
      "state": "IL",
      "date_time": "1979-10-31T00:00:00",
      "shape": "disk",
      "duration": "<5 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155956.html",
      "text": "Close up with a UFO I’ve decided to write down my story after listening to Peter on the Richard Dolan show where they had admonished people for never writing down their UFO stories. This is my story. I was 22 years old and lived in my home town of Springfield, Illinois.  I worked in a local grocery store and had finished my 3 to 11 shift and heading home. It was a weeknight as I recall and I had nothing to do, so I decided to grab a couple of beers and go for a drive in the country. Keep in mind that at this time, I had no interest in UFO’s and rarely considered them.  If you were to have asked me about them I would have shrugged off the question and considered it strange. I don’t remember the date because this happened so long ago, but the year was 1979, late October or early November. The leaves were off the trees, it was seasonably cool and the corn stubble left after the harvest in the fields had yet to be soaked and laid down by snow. The county roads in central Illinois at this time of night were completely deserted and at the time, the area I was driving in was sparsely developed and only a few lights from windows in a few houses could be seen. It was an overcast, moonless night and it was very dark. I was heading west on a very familiar road, away from town. I saw ahead of me, maybe a mile or less, three very bright lights suspended low above the ground, in a triangular configuration, motionless. My first thought was that I was looking at a helicopter with search lights, but that idea quickly evaporated as I neared the spectacle. It was just a matter of a few seconds before I was upon them. I looked out into the adjacent field and marveled at how brightly these lights illuminated a field of corn stubble. A shimmering blue-white light that lit the ground like nothing I had ever seen. I noted these lights still above me and to the right. There was a crossroads at that spot and I turned right and stopped to get a better look.( My intense curiosity and utter amazement must have pushed away any other thoughts, fear or self preservation). As soon as I did, the lights went off. I looked up out of my windshield and I could see hovering above me a large object. It was close enough I could have hit it with a underhand toss of a rock. I noticed the object had a convex bottom and had a shimmering brushed metal appearance reflecting the light of my headlights. It had a bluish color like some metals take on when exposed to extreme heat. There were two bright red lights on the side of the craft, shaped like thin, foot long tubes laid almost end to end, but aside each other with their ends touching side to side. These lights blinked alternately in one or two second intervals. I could tell ( I think) the object was rotating in place because of the slow arch they were ma! king above my car. Again, in utter fascination, I set the brake and got out of my car and stood by the door to get a closer look. Amazingly, without a sound, the object had vanished. I looked across the darkened field and could see, barely, maybe a hundred yards away, the outline of a craft sitting above a windrow of trees.  The shape was like two dinner plates, one up, one down with a cheesecake ring between. It was barely back lit by the lights of town on the horizon behind it.  I watched as it slowly lowered itself behind the windrow and as it did, without putting of any light of its own, illuminated the ground and trees around it with a dim yellow glow, as if it were somehow irradiating the objects around it.  I then watched it take off from behind the windrow, back across the road I was just on at incredible speed, again, without a sound. I stood there for a moment, awestruck. That’s when I began to formulate what I just saw in my mind, and decided get away from there as fast as possible. I’ve only told this story to a few people, including my wife of 30 years.  I don’t believe she or any of the others I’ve told ever believed me.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "39.795137628866065",
      "city_longitude": "-89.66251786941532",
      "id": 83
    },
    {
      "summary": "Big UFO hovering over a house",
      "city": "Comalcalco (Mexico)",
      "state": "",
      "date_time": "1980-06-01T15:00:00",
      "shape": "other",
      "duration": "4:00",
      "report_link": "http://www.nuforc.org/webreports/155/S155126.html",
      "text": "Big UFO hovering over a house 1980 Comalcalco México at approximately 15:00 I was playing by myself at the back yard of my uncle house when I hear music coming from the sky I turned my head up and see this object like a express cooking pot up right over me the object was doing circular motion I couldn't call nobody I was alone by the time at about 19:00 pm I wake-up  and realized that I have been falling sleep there in the back yard it was dark by the time , I remember to see my mother cooking something inside the house, when I was just about run inside the house I hear music again over my head I turned my head up and see that the object was  still there like watching me , this time it was illuminated by lights all around it was moving in circles and I hear music coming from it , them I hear a voice talking to me , the voice was coming from the object , at the moment I understand everything that voice said , and I was answering and talking to the object too I was happy , then I hear my ! mother called me and looking at me but I couldn't no understand what she was saying I call her to come outside and see that too when she see that in the sky she call me to come inside the house but I didn't the object then start moving away very slowly . I run behind it and almost was run over by a taxi cab my father was on it coming from work he call me to comeback and to stop running behind that object I was running behind it for about 100 meters till the object disappear behind the Forrest of a park . My mother Saw it my father saw it . In the days after that I see orange spheres of light flooting and watching me every time I was playing outside . I was almost 6 year's old by the time . Since then I been thinking about that experience , what was that .",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 84
    },
    {
      "summary": "Crop circle seen in upstate Medina, NY at side of road near Iroquois Job Corps Center.",
      "city": "Medina",
      "state": "NY",
      "date_time": "1980-06-30T15:00:00",
      "shape": "other",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156118.html",
      "text": "Crop circle seen in upstate Medina, NY at side of road near Iroquois Job Corps Center. Crop circle seen in Medina, NY.  In 1980, I was 16 years old and a resident of Iroquois Job Corps Center in Medina, NY.  I often walked along the main road that led onto the property. One mid afternoon, I saw an odd  circular pattern of intertwined wheat just off the right side of the road.  I now know that it was a crop circle, probably made/left behind by a small UFO.  The circle wasn’t very big, maybe about 7 feet in diameter. It was awesome.  The green stalks had a glossy appearance because they were so evenly flat.  And the joints were bent (nodes?).²  I could not imagine what type of machinery created that pattern, and its presence did scare me a little, because I had never seen anything like it before that day (nor since it).  Special Note: One late night some weeks later, me and three other residents left the property (went AWOL) and walked very far to a bar in a neighboring town. Along the way, the roads became completely dark. We made it to the bar, and the trip seemed mostly uneventful. Soon after, IJCC staff came and got us and drove us back to the center.  During the ride back, one male friend said it took us longer to get to the bar than it should have (He'd made the trip before).  Around that time at the center, I began having UFO dreams and one was of a UFO invasion.  Fast forward year 1990 or so, I had the exact same 1980 UFO invasion dream.  Then, around year 2000 I began having a vague memory of one moment of that 1980 night. In that memory the four of us are standing on a stretch of road in pitch dark except for a single, small, dark, circular UFO. The craft was on or hovered close to the ground just off the road to my right. The lights of the craft lit the immediate area. My friends stood a few feet across from me. That is all I remember.  Did something happen? Maybe. I now know that the area was notorious for ‘strange' activity and that there was one or two stretches of road leading to and from IJCC that the staff wished to avoid after dark.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "43.21759999999997",
      "city_longitude": "-78.36040000000001",
      "id": 85
    },
    {
      "summary": "Huge rectangular craft with missing time",
      "city": "Winchester",
      "state": "MA",
      "date_time": "1980-10-20T21:00:00",
      "shape": "rectangle",
      "duration": "20 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156490.html",
      "text": "Huge rectangular craft with missing time I was riding my 10 speed home and there is a large steep hill on the way from Woburn to Winchester.  i usually coasted down that hill because by the bottom i could reach speeds up to 40 mph.  I started down the hill and next thing i knew i was back at the top of the hill watching a huge rectangular craft with many lights on it flying away perhaps 2/10 mile away in a  1 O'clock position relative to my position.  I estimate the hill itself was between 1-2 football fields in length with a 60 degree incline.  A short time had passed and i had no memory of the missing time.  The craft was huge and i can only guess its size at perhaps 1000 feet long or more but no sounds or exhaust were seen.  There were 4 rows of lights along its side that glowed white and steady.  Over the next 1-2 years i began getting strangers coming in to my work asking for me and not leaving any contact info.  This happened enough to draw concerns among coworkers.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "42.45470000000013",
      "city_longitude": "-71.15020000000003",
      "id": 86
    },
    {
      "summary": "Saucer Observed at Hopi Reservation in AZ",
      "city": "Second Mesa",
      "state": "AZ",
      "date_time": "1980-12-27T20:00:00",
      "shape": "disk",
      "duration": "1 hour",
      "report_link": "http://www.nuforc.org/webreports/156/S156116.html",
      "text": "Saucer Observed at Hopi Reservation in AZ Date of this Report: 5/2/2020 Date of Sighting: Saturday, 12/27/1980 Place: Second Mesa, AZ (Hopi Reservation)  My Cousin George, my 2 friends, and I drove to Arizona on Friday, December 26, 1980, from Orange County, CA.  On Saturday night at about 8PM, George and I were collecting firewood.  My Cousin said….”Look, what is that?”  I looked, on the horizon there was a saucer shaped object.  I would guess it was about 3 miles away, and about 300 yards across. The first words out of my mouth were…”I know what it is, and I’m getting out of here.”  We stayed though.  We watched it for about an hour.  It had a rather soft light to it, almost pastel, and the size and shape seemed to subtly change from minute to minute.  It would slide back and forth across the horizon.  It directed beams of light at the ground as though it was probing (there are Uranium Mines out there).  It also was directing beams of light up in to space, as though it was communicating with a Mothership.  It had small spheres, red and white which it was also directing out on the horizon, which looked like probes to me.  The ground lit up near us, and then the light went out.  Then, two spheres about 3 feet across were floating across the Mesa, between the Pinyon Pines towards us.  I was terrified.  I though Life as I knew it was going to end.  Then, the lights just went out.  After about an hour, the main Saucer object became dormant, so we returned to the campground where my 2 Friends were.  My two Friends saw it when we returned to the campground and pointed it out to them.  The first thing they did was retreat to the Café there on Second Mesa.  We went to sleep, and in the morning, that distant object did not present itself anymore.  A Hopi Indian at the Café told my 2 Friends it was just a town in the distance.  I think they may have misidentified what we were watching.  My Cousin and I spent a long time watching this thing.  My Friends were scared and so they did not spend any time studying it, just a minute.   George died about a year ago.  I would like to point out that this incident occurred at the same time as the Rendlesham Forest incident in Great Britain.  In addition, my encounter was only about 60 miles from where the Travis Walton incident occurred.  There are some time and space coordinates for you.  I do not think either of those things are just coincidences.  Very Respectfully,  Bernard C. California",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 87
    },
    {
      "summary": "30+ orange balls playing in Australia",
      "city": "Hobart (Australia)",
      "state": "",
      "date_time": "1982-03-16T18:00:00",
      "shape": "fireball",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155180.html",
      "text": "30+ orange balls playing in Australia In 1982 when I was 12 years old my father, mother, sister and I were returning home from my uncles farm along an unsealed road which was a short cut back to our house. There was a few houses along the road but mainly just fields where sheep, horses and cows grazed. This was our usual route home and there was rarely anything to see. In the distance we witnessed what appeared to be fireworks so as we got closer my father pulled over and stopped the car. Approximately 100 yards away we noticed that it wasn't fireworks as there was no one to ignite them and they larger perfectly rounded balls of a fiery orange color. They were the size of the inflatable \"fit balls\" used in gyms. These balls of orange seemed to be playing in the long dry grass. Some rose above the ground slowly and then seemed to hover 10ft in the air while others moved in rapidly in all directions. There was approximately 30 but may have been more and they all moved independently . We ! sat in the car puzzled as to what we were seeing. We watched for a few minutes as these balls of light moved everywhere and with more acceleration and at a speed I've never seen before or since. They moved up and down  and left and right,some hovering together while others moved around them. There was no noise only the lights. After several minutes of watching from inside of the car we got out of the car and as we did the balls of light scattered off and disappeared over the hill into the next gully. The speed at which they flew off over the hill was incredible. We talked all the way home about what we'd witnessed but when we went to bed that night my mother who was a school teacher said we can't tell anyone about this as only crazy people saw things like this. This happened in Australia's smallest state of Tasmania, an island state south of mainland Australia where there is no air force and limited army facilities. It was on privately owned farm land with the nearest house! a few miles away. As I was only 12 at the time I always thoug! ht I'd s ee something like this again but now nearly 40 years later I've never seen or even heard of anything like this again. All I know is that they were (1)UNIDENTIFIED (2)FLYING (3)OBJECTS",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 88
    },
    {
      "summary": "White orb over I-85 in Durham NC early 80’s.",
      "city": "Durham",
      "state": "NC",
      "date_time": "1982-06-30T21:00:00",
      "shape": "circle",
      "duration": "5 seconds",
      "report_link": "http://www.nuforc.org/webreports/156/S156955.html",
      "text": "White orb over I-85 in Durham NC early 80’s I was a kid, and witnessed an orb like light over I-85 while traveling with family.  It was white. This was the early 1980’s so I was about 9 years old.  They didn’t see it but I was a kid and looking straight up into the sky.  It moved faster than I can explain. Nothing I have seen since to compare it too. It zoomed over the highway. Then came to a dead stop, about several hundred feet above the hwy.  within seconds it zoomed back off into the sky going upwards.  There was no sound.  Have never forgotten this moment.  I knew it was something out of the ordinary.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "35.98046262866154",
      "city_longitude": "-78.89813626286602",
      "id": 89
    },
    {
      "summary": "((HOAX??))  Hat Shaped UFO.  ((anonymous))",
      "city": "Alexandria",
      "state": "VA",
      "date_time": "1982-07-13T23:00:00",
      "shape": "other",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155536.html",
      "text": "Finished playing kickball with my friends in our court and noticed a silver object flying at house/roof top level thru Stonebridge Road.  Some how object saw me and turned left behind the homes to confront me.  I ran from the object until it cornered me behind the Bell's car.  The object hovered above me for one minute and raised its antenna.  It seemed the object was studying me, and I was scared!  It retracted its antenna and at the speed of light (I can only say) left for outer space.  The object was a silver shaped hat.  It was approximately 1 to 2 feet high.  It made no sounds as it flew thru the air.  No air was disturbed.  Finally, when it did leave, it made no sounds and did not disturb the air.  I did watch a show on UFO Hunters, on the History Channel, covering a UFO sighting in August 1982 in Brazil.  It was the same hat shaped UFO that attacked me that was playing with Brazil's air force.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "38.798958214042806",
      "city_longitude": "-77.09513265167011",
      "id": 90
    },
    {
      "summary": "Cone shaped object of glass like spheres, changed shape to a V.",
      "city": "West Carson",
      "state": "CA",
      "date_time": "1982-07-15T20:30:00",
      "shape": "changing",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156689.html",
      "text": "Cone shaped object of glass like spheres, changed shape to a V. We were driving north around sunset between 8pm and 9pm. Im guessing the time we were not sure, the sun sets between those hours in the summer. Summer of 82. Mostly warehouses and commercial property. Clear sky, no other traffic at the time. To our immediate left, (west) was a flower nursery. My friend from the drivers side of his van, looking to the west said \"what the hell is that? He said something was rising from the field.  He pulled the van over and said it is passing over the rear of the van. I stuck my head out the passenger window, looking to my right and to the rear approximately 15ft to 20 ft back and around 25 ft in the air was an object. Approximately 8 to 10 ft in height. It was in the shape of a cone or a upside down xmas tree. At the widest part the top of the cone was around 6 to 7 ft diameter, the small end or bottom was 1 to 2 ft in diameter.  The cone was made up of round glass like spheres, a little more than the size of a basketball. There was no structure or frame holding the spheres together that we saw. 1 sphere at the bottom and multiplies as you go up the cone. Inside the spheres was it seemed to us, was a white hot fire or energy, but it was constant white, not like a flickering fire and white.  The object stayed in one position and did not move or make any noise, it was motionless. There was no smoke or hum. There are electrical and phones lines, object was about 15 ft away from the lines. There was no breeze. It was also not far from a street light so we saw it very clearly. There was no reaction from the electrical lines or street light.  After a short time it changed shape to a V. We did not see a transformation, or noise, it was just a V. Not clear at what point this happened, either before it changed shape or after, we saw what appeared to be fire dropping from the object, not much of it but like if burning plastic fell from it, and it was more like normal fire burning. I would say less than a half of a cup of the burning liquid.  It was still motionless and It remained for less that a minute I guess, and then it was gone. It simply disappeared. There was no sound, or whoosh, or trace of light or noise. It vainshed without a trace of it ever being there.  It was there, than it was not. Same as the shape change. it was a cone, then it was a V shape.  I don’t know what the object was and we never reported it to anyone.  I am guessing  that for that object to vanish like it did would likely to me anyway, have something to do with time. If there was some kind of propulsion, we never saw or heard it, and there was no remnants, no smell.  The total time from it coming up from he field to vanishing is a little hard to determine. It seems to happen within a 2 or 3 minute span, but were just a little lost on that.  I thought we watched it a little longer. The time of it all is a little fuzzy.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 91
    },
    {
      "summary": "I was living out in a rural area. I was getting ready for work.  I heard a loud roaring like an airplane landing. I knew there wasn't",
      "city": "Lawrenceburg",
      "state": "KY",
      "date_time": "1982-10-01T05:30:00",
      "shape": "triangle",
      "duration": "15 minutes",
      "report_link": "http://www.nuforc.org/webreports/157/S157071.html",
      "text": "I was living out in a rural area. I was getting ready for work.  I heard a loud roaring like an airplane landing. I knew there wasn't  a airport near. I went to look outside.  In the air coming over the tree line I seen a large triangle shaped craft moving very slowly.  It was barely clearing the trees. There were many lights under the craft. The whole yard was lit up.  I had a small child and was very weary about leaving home that morning.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "38.00520000000002",
      "city_longitude": "-84.98299999999998",
      "id": 92
    },
    {
      "summary": "Oval Craft Being Escorted by British Fighter.",
      "city": "Alexandria",
      "state": "VA",
      "date_time": "1983-09-01T17:00:00",
      "shape": "oval",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155763.html",
      "text": "Oval Craft Being Escorted by British Fighter.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "38.798958214042806",
      "city_longitude": "-77.09513265167011",
      "id": 93
    },
    {
      "summary": "The night was extremely clear and a little brisk.",
      "city": "Florissant",
      "state": "MO",
      "date_time": "1987-12-15T21:15:00",
      "shape": "formation",
      "duration": "10 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156522.html",
      "text": "The night was extremely clear and a little brisk. I live on a subdivision thruway. My son-in-law and his best friend and I had just loaded U-Haul of my daughter's stuff to go to Georgia were her family was stationed with the Army. Lambert Airport was about 8 miles away as the crow flies. At that time you could watch the planes lining up for landing in a cake pan pattern. So you could view  the planes circling St. LOUIS getting ready to land. Not any more because the trees have 40 years tree growth. Anyway, as we finished loading and drinking a beer a fleet of three groups of UFOs flew to the right of us in the Western sky about 2000 feet off the deck going hundreds of miles an hour with a black cloud behind them. They were V shaped. With two sided bright orange lights in a classic flock pattern. The cars in the street stopped on a dime and the occupants got out. The airport lit up like a Vesuvious Fountain. Our National Guard Unit filled the skies with every F 15 they had. They chased the fleet on a NNE glide path.  During those days I had a delivery route that encompassed the Airport. I used to watch the F 15 s takeoff. They used to take off Hot. They used minimum runway. Then they pulled to a 90°straight up position while doing a 360° spiral. Then they would fall on their back and seem to fall in the direction they wanted to go. Like a left turn. Then they would do a 180°to straighten out. Very impressive to see that is what those F 15 s did that night. One other aside. The best friend of my son-in-law was pretty shook up. He was Navy. He turned to me and said, I should not say this to you. I have seen a bunch of classified stuff. At sea we have shot a lot of missiles off at the Korean Peninsula and sent a lot of jets in war games. I have seen a lot. I have never seen anything like this. The next day the radio reported that a Russion sattelite flew over St. LOUIS and landed in Oklahoma. That is exactly the opposite direction of this event.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "38.807988732394406",
      "city_longitude": "-90.31338873239417",
      "id": 94
    },
    {
      "summary": "I was visiting a friend in Clinton ms. We walked outside in the driveway. Looked across the street. Then saw a ring of lights hovering",
      "city": "Clinton",
      "state": "MS",
      "date_time": "1988-01-10T19:00:00",
      "shape": "circle",
      "duration": "5 minutes",
      "report_link": "http://www.nuforc.org/webreports/154/S154799.html",
      "text": "I was visiting a friend in Clinton ms. We walked outside in the driveway. Looked across the street. Then saw a ring of lights hovering over someone’s house. It was at night but it looked disc shaped. The ring of lights was around the outer part of the craft. The center was dark. The lights were multi colored lights. Red, blue, yellow lights from what I can remember. The strange thing was it made no sound. I asked her, my friend what the heck is that. I said is that usually there. She said no. Then as if it saw us. At that moment it started moving away from us. It never went up. We could see the lights through the trees as it moved away from us til it disappeared.  I said let’s get in the car and try to see it again. We rode around couldn’t see it anymore. I thought about calling police reporting it but figured they wouldn’t believe us.  Since then I’ve always watched the sky’s but haven’t seen anything else like it. It’s forever etched in mind.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "32.365880952380955",
      "city_longitude": "-90.35684761904764",
      "id": 95
    },
    {
      "summary": "Simple triangle 40/50 yards across. Blue soft light up front. Solve mover no noise for its size.",
      "city": "Hahn A B (Germany)",
      "state": "",
      "date_time": "1988-06-01T02:00:00",
      "shape": "triangle",
      "duration": "7 minutes",
      "report_link": "http://www.nuforc.org/webreports/157/S157139.html",
      "text": "Simple triangle 40/50 yards across.  Blue soft light up front.  Solve mover no noise for its size.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 96
    },
    {
      "summary": "Saw neon orange oval craft hovering 3 to 4 ft above road.",
      "city": "Mumford",
      "state": "NY",
      "date_time": "1988-08-14T20:00:00",
      "shape": "oval",
      "duration": "3-4 minutes",
      "report_link": "http://www.nuforc.org/webreports/156/S156148.html",
      "text": "Saw neon orange oval craft hovering 3 to 4 ft above road. I was walking down a road off CR 180 and South of I-90 when I saw a neon orange oval craft rise up from the top of a hill. In about 3 seconds it seemed to just \"appear\" hovering approximately 3 to 4 ft above the road. It nearly took up the width of the road. The body of the craft seemed to be solid but the exterior was enveloped in a neon orange gaseous aura.  Through the middle of the craft were round opaque plasma looking porthole windows.  I would estimate that there were 6 to 8 of these porthole windows lining the middle of the craft.  There was a space between each respective window.  The craft made no noise and had no apparent propulsion system from what I could see. I watched it for what seemed to be about 3 to 4 minutes.I would estimate I was approximately 15 ft away from the craft.  Then it took off at insurmountable speeds at an angle in between two trees and seemed to just vanish in thin air.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "42.992799999999995",
      "city_longitude": "-77.86029999999998",
      "id": 97
    },
    {
      "summary": "Cone shaped craft, size of small car, approx 50 feet above ground. Shot up in sky when I started running.",
      "city": "Vanport",
      "state": "PA",
      "date_time": "1989-02-17T20:30:00",
      "shape": "cone",
      "duration": "2 minutes",
      "report_link": "http://www.nuforc.org/webreports/155/S155403.html",
      "text": "Cone shaped craft, size of small car, approx 50 feet above ground. Shot up in sky when I started running. Saw cone the size of a small car gently rocking about 50 ft above ground and approx. 50 ft away as I was walking around a corner.  Nobody else around at that point. I stopped in shock and looked at it wishing a car would come by so I had a witness.  It saw me move forward a few feet because it would move too.  I was a block away from my Mother’s house and decided to run to her place quickly to get her to see it.  When I ran it shot up in the night sky quickly and silently and when it reached the height of an airplane a large light came on at the bottom of the craft.  Managed to get my brother in law out to see the light.",
      "posted": "2020-06-25T00:00:00",
      "city_latitude": "",
      "city_longitude": "",
      "id": 98
    }
  ]
}
